MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile TXERRCNTbits_t TXERRCNTbits __at(0xE42);
// bitfield macros
#define _TXERRCNT_TEC_POSN                                  0x0
#define _TXERRCNT_TEC_POSITION                              0x0
#define _TXERRCNT_TEC_SIZE                                  0x8
#define _TXERRCNT_TEC_LENGTH                                0x8
#define _TXERRCNT_TEC_MASK                                  0xFF
#define _TXERRCNT_TEC0_POSN                                 0x0
#define _TXERRCNT_TEC0_POSITION                             0x0
#define _TXERRCNT_TEC0_SIZE                                 0x1
#define _TXERRCNT_TEC0_LENGTH                               0x1
#define _TXERRCNT_TEC0_MASK                                 0x1
#define _TXERRCNT_TEC1_POSN                                 0x1
#define _TXERRCNT_TEC1_POSITION                             0x1
#define _TXERRCNT_TEC1_SIZE                                 0x1
#define _TXERRCNT_TEC1_LENGTH                               0x1
#define _TXERRCNT_TEC1_MASK                                 0x2
#define _TXERRCNT_TEC2_POSN                                 0x2
#define _TXERRCNT_TEC2_POSITION                             0x2
#define _TXERRCNT_TEC2_SIZE                                 0x1
#define _TXERRCNT_TEC2_LENGTH                               0x1
#define _TXERRCNT_TEC2_MASK                                 0x4
#define _TXERRCNT_TEC3_POSN                                 0x3
#define _TXERRCNT_TEC3_POSITION                             0x3
#define _TXERRCNT_TEC3_SIZE                                 0x1
#define _TXERRCNT_TEC3_LENGTH                               0x1
#define _TXERRCNT_TEC3_MASK                                 0x8
#define _TXERRCNT_TEC4_POSN                                 0x4
#define _TXERRCNT_TEC4_POSITION                             0x4
#define _TXERRCNT_TEC4_SIZE                                 0x1
#define _TXERRCNT_TEC4_LENGTH                               0x1
#define _TXERRCNT_TEC4_MASK                                 0x10
#define _TXERRCNT_TEC5_POSN                                 0x5
#define _TXERRCNT_TEC5_POSITION                             0x5
#define _TXERRCNT_TEC5_SIZE                                 0x1
#define _TXERRCNT_TEC5_LENGTH                               0x1
#define _TXERRCNT_TEC5_MASK                                 0x20
#define _TXERRCNT_TEC6_POSN                                 0x6
#define _TXERRCNT_TEC6_POSITION                             0x6
#define _TXERRCNT_TEC6_SIZE                                 0x1
#define _TXERRCNT_TEC6_LENGTH                               0x1
#define _TXERRCNT_TEC6_MASK                                 0x40
#define _TXERRCNT_TEC7_POSN                                 0x7
#define _TXERRCNT_TEC7_POSITION                             0x7
#define _TXERRCNT_TEC7_SIZE                                 0x1
#define _TXERRCNT_TEC7_LENGTH                               0x1
#define _TXERRCNT_TEC7_MASK                                 0x80

// Register: BRGCON1
#define BRGCON1 BRGCON1
extern volatile unsigned char           BRGCON1             __at(0xE43);
#ifndef _LIB_BUILD
asm("BRGCON1 equ 0E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRP                    :6;
        unsigned SJW                    :2;
    };
    struct {
        unsigned BRP0                   :1;
        unsigned BRP1                   :1;
        unsigned BRP2                   :1;
        unsigned BRP3                   :1;
        unsigned BRP4                   :1;
        unsigned BRP5                   :1;
        unsigned SJW0                   :1;
        unsigned SJW1                   :1;
    };
} BRGCON1bits_t;
extern volatile BRGCON1bits_t BRGCON1bits __at(0xE43);
// bitfield macros
#define _BRGCON1_BRP_POSN                                   0x0
#define _BRGCON1_BRP_POSITION                               0x0
#define _BRGCON1_BRP_SIZE                                   0x6
#define _BRGCON1_BRP_LENGTH                                 0x6
#define _BRGCON1_BRP_MASK                                   0x3F
#define _BRGCON1_SJW_POSN                                   0x6
#define _BRGCON1_SJW_POSITION                               0x6
#define _BRGCON1_SJW_SIZE                                   0x2
#define _BRGCON1_SJW_LENGTH                                 0x2
#define _BRGCON1_SJW_MASK                                   0xC0
#define _BRGCON1_BRP0_POSN                                  0x0
#define _BRGCON1_BRP0_POSITION                              0x0
#define _BRGCON1_BRP0_SIZE                                  0x1
#define _BRGCON1_BRP0_LENGTH                                0x1
#define _BRGCON1_BRP0_MASK                                  0x1
#define _BRGCON1_BRP1_POSN                                  0x1
#define _BRGCON1_BRP1_POSITION                              0x1
#define _BRGCON1_BRP1_SIZE                                  0x1
#define _BRGCON1_BRP1_LENGTH                                0x1
#define _BRGCON1_BRP1_MASK                                  0x2
#define _BRGCON1_BRP2_POSN                                  0x2
#define _BRGCON1_BRP2_POSITION                              0x2
#define _BRGCON1_BRP2_SIZE                                  0x1
#define _BRGCON1_BRP2_LENGTH                                0x1
#define _BRGCON1_BRP2_MASK                                  0x4
#define _BRGCON1_BRP3_POSN                                  0x3
#define _BRGCON1_BRP3_POSITION                              0x3
#define _BRGCON1_BRP3_SIZE                                  0x1
#define _BRGCON1_BRP3_LENGTH                                0x1
#define _BRGCON1_BRP3_MASK                                  0x8
#define _BRGCON1_BRP4_POSN                                  0x4
#define _BRGCON1_BRP4_POSITION                              0x4
#define _BRGCON1_BRP4_SIZE                                  0x1
#define _BRGCON1_BRP4_LENGTH                                0x1
#define _BRGCON1_BRP4_MASK                                  0x10
#define _BRGCON1_BRP5_POSN                                  0x5
#define _BRGCON1_BRP5_POSITION                              0x5
#define _BRGCON1_BRP5_SIZE                                  0x1
#define _BRGCON1_BRP5_LENGTH                                0x1
#define _BRGCON1_BRP5_MASK                                  0x20
#define _BRGCON1_SJW0_POSN                                  0x6
#define _BRGCON1_SJW0_POSITION                              0x6
#define _BRGCON1_SJW0_SIZE                                  0x1
#define _BRGCON1_SJW0_LENGTH                                0x1
#define _BRGCON1_SJW0_MASK                                  0x40
#define _BRGCON1_SJW1_POSN                                  0x7
#define _BRGCON1_SJW1_POSITION                              0x7
#define _BRGCON1_SJW1_SIZE                                  0x1
#define _BRGCON1_SJW1_LENGTH                                0x1
#define _BRGCON1_SJW1_MASK                                  0x80

// Register: BRGCON2
#define BRGCON2 BRGCON2
extern volatile unsigned char           BRGCON2             __at(0xE44);
#ifndef _LIB_BUILD
asm("BRGCON2 equ 0E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRSEG                  :3;
        unsigned SEG1PH                 :3;
        unsigned SAM                    :1;
        unsigned SEG2PHTS               :1;
    };
    struct {
        unsigned PRSEG0                 :1;
        unsigned PRSEG1                 :1;
        unsigned PRSEG2                 :1;
        unsigned SEG1PH0                :1;
        unsigned SEG1PH1                :1;
        unsigned SEG1PH2                :1;
    };
    struct {
        unsigned                        :7;
        unsigned SEG2PHT                :1;
    };
} BRGCON2bits_t;
extern volatile BRGCON2bits_t BRGCON2bits __at(0xE44);
// bitfield macros
#define _BRGCON2_PRSEG_POSN                                 0x0
#define _BRGCON2_PRSEG_POSITION                             0x0
#define _BRGCON2_PRSEG_SIZE                                 0x3
#define _BRGCON2_PRSEG_LENGTH                               0x3
#define _BRGCON2_PRSEG_MASK                                 0x7
#define _BRGCON2_SEG1PH_POSN                                0x3
#define _BRGCON2_SEG1PH_POSITION                            0x3
#define _BRGCON2_SEG1PH_SIZE                                0x3
#define _BRGCON2_SEG1PH_LENGTH                              0x3
#define _BRGCON2_SEG1PH_MASK                                0x38
#define _BRGCON2_SAM_POSN                                   0x6
#define _BRGCON2_SAM_POSITION                               0x6
#define _BRGCON2_SAM_SIZE                                   0x1
#define _BRGCON2_SAM_LENGTH                                 0x1
#define _BRGCON2_SAM_MASK                                   0x40
#define _BRGCON2_SEG2PHTS_POSN                              0x7
#define _BRGCON2_SEG2PHTS_POSITION                          0x7
#define _BRGCON2_SEG2PHTS_SIZE                              0x1
#define _BRGCON2_SEG2PHTS_LENGTH                            0x1
#define _BRGCON2_SEG2PHTS_MASK                              0x80
#define _BRGCON2_PRSEG0_POSN                                0x0
#define _BRGCON2_PRSEG0_POSITION                            0x0
#define _BRGCON2_PRSEG0_SIZE                                0x1
#define _BRGCON2_PRSEG0_LENGTH                              0x1
#define _BRGCON2_PRSEG0_MASK                                0x1
#define _BRGCON2_PRSEG1_POSN                                0x1
#define _BRGCON2_PRSEG1_POSITION                            0x1
#define _BRGCON2_PRSEG1_SIZE                                0x1
#define _BRGCON2_PRSEG1_LENGTH                              0x1
#define _BRGCON2_PRSEG1_MASK                                0x2
#define _BRGCON2_PRSEG2_POSN                                0x2
#define _BRGCON2_PRSEG2_POSITION                            0x2
#define _BRGCON2_PRSEG2_SIZE                                0x1
#define _BRGCON2_PRSEG2_LENGTH                              0x1
#define _BRGCON2_PRSEG2_MASK                                0x4
#define _BRGCON2_SEG1PH0_POSN                               0x3
#define _BRGCON2_SEG1PH0_POSITION                           0x3
#define _BRGCON2_SEG1PH0_SIZE                               0x1
#define _BRGCON2_SEG1PH0_LENGTH                             0x1
#define _BRGCON2_SEG1PH0_MASK                               0x8
#define _BRGCON2_SEG1PH1_POSN                               0x4
#define _BRGCON2_SEG1PH1_POSITION                           0x4
#define _BRGCON2_SEG1PH1_SIZE                               0x1
#define _BRGCON2_SEG1PH1_LENGTH                             0x1
#define _BRGCON2_SEG1PH1_MASK                               0x10
#define _BRGCON2_SEG1PH2_POSN                               0x5
#define _BRGCON2_SEG1PH2_POSITION                           0x5
#define _BRGCON2_SEG1PH2_SIZE                               0x1
#define _BRGCON2_SEG1PH2_LENGTH                             0x1
#define _BRGCON2_SEG1PH2_MASK                               0x20
#define _BRGCON2_SEG2PHT_POSN                               0x7
#define _BRGCON2_SEG2PHT_POSITION                           0x7
#define _BRGCON2_SEG2PHT_SIZE                               0x1
#define _BRGCON2_SEG2PHT_LENGTH                             0x1
#define _BRGCON2_SEG2PHT_MASK                               0x80

