MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile RXF10EIDLbits_t RXF10EIDLbits __at(0xE5B);
// bitfield macros
#define _RXF10EIDL_EID_POSN                                 0x0
#define _RXF10EIDL_EID_POSITION                             0x0
#define _RXF10EIDL_EID_SIZE                                 0x8
#define _RXF10EIDL_EID_LENGTH                               0x8
#define _RXF10EIDL_EID_MASK                                 0xFF
#define _RXF10EIDL_EID0_POSN                                0x0
#define _RXF10EIDL_EID0_POSITION                            0x0
#define _RXF10EIDL_EID0_SIZE                                0x1
#define _RXF10EIDL_EID0_LENGTH                              0x1
#define _RXF10EIDL_EID0_MASK                                0x1
#define _RXF10EIDL_EID1_POSN                                0x1
#define _RXF10EIDL_EID1_POSITION                            0x1
#define _RXF10EIDL_EID1_SIZE                                0x1
#define _RXF10EIDL_EID1_LENGTH                              0x1
#define _RXF10EIDL_EID1_MASK                                0x2
#define _RXF10EIDL_EID2_POSN                                0x2
#define _RXF10EIDL_EID2_POSITION                            0x2
#define _RXF10EIDL_EID2_SIZE                                0x1
#define _RXF10EIDL_EID2_LENGTH                              0x1
#define _RXF10EIDL_EID2_MASK                                0x4
#define _RXF10EIDL_EID3_POSN                                0x3
#define _RXF10EIDL_EID3_POSITION                            0x3
#define _RXF10EIDL_EID3_SIZE                                0x1
#define _RXF10EIDL_EID3_LENGTH                              0x1
#define _RXF10EIDL_EID3_MASK                                0x8
#define _RXF10EIDL_EID4_POSN                                0x4
#define _RXF10EIDL_EID4_POSITION                            0x4
#define _RXF10EIDL_EID4_SIZE                                0x1
#define _RXF10EIDL_EID4_LENGTH                              0x1
#define _RXF10EIDL_EID4_MASK                                0x10
#define _RXF10EIDL_EID5_POSN                                0x5
#define _RXF10EIDL_EID5_POSITION                            0x5
#define _RXF10EIDL_EID5_SIZE                                0x1
#define _RXF10EIDL_EID5_LENGTH                              0x1
#define _RXF10EIDL_EID5_MASK                                0x20
#define _RXF10EIDL_EID6_POSN                                0x6
#define _RXF10EIDL_EID6_POSITION                            0x6
#define _RXF10EIDL_EID6_SIZE                                0x1
#define _RXF10EIDL_EID6_LENGTH                              0x1
#define _RXF10EIDL_EID6_MASK                                0x40
#define _RXF10EIDL_EID7_POSN                                0x7
#define _RXF10EIDL_EID7_POSITION                            0x7
#define _RXF10EIDL_EID7_SIZE                                0x1
#define _RXF10EIDL_EID7_LENGTH                              0x1
#define _RXF10EIDL_EID7_MASK                                0x80
#define _RXF10EIDL_RXF10EID0_POSN                           0x0
#define _RXF10EIDL_RXF10EID0_POSITION                       0x0
#define _RXF10EIDL_RXF10EID0_SIZE                           0x1
#define _RXF10EIDL_RXF10EID0_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID0_MASK                           0x1
#define _RXF10EIDL_RXF10EID1_POSN                           0x1
#define _RXF10EIDL_RXF10EID1_POSITION                       0x1
#define _RXF10EIDL_RXF10EID1_SIZE                           0x1
#define _RXF10EIDL_RXF10EID1_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID1_MASK                           0x2
#define _RXF10EIDL_RXF10EID2_POSN                           0x2
#define _RXF10EIDL_RXF10EID2_POSITION                       0x2
#define _RXF10EIDL_RXF10EID2_SIZE                           0x1
#define _RXF10EIDL_RXF10EID2_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID2_MASK                           0x4
#define _RXF10EIDL_RXF10EID3_POSN                           0x3
#define _RXF10EIDL_RXF10EID3_POSITION                       0x3
#define _RXF10EIDL_RXF10EID3_SIZE                           0x1
#define _RXF10EIDL_RXF10EID3_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID3_MASK                           0x8
#define _RXF10EIDL_RXF10EID4_POSN                           0x4
#define _RXF10EIDL_RXF10EID4_POSITION                       0x4
#define _RXF10EIDL_RXF10EID4_SIZE                           0x1
#define _RXF10EIDL_RXF10EID4_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID4_MASK                           0x10
#define _RXF10EIDL_RXF10EID5_POSN                           0x5
#define _RXF10EIDL_RXF10EID5_POSITION                       0x5
#define _RXF10EIDL_RXF10EID5_SIZE                           0x1
#define _RXF10EIDL_RXF10EID5_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID5_MASK                           0x20
#define _RXF10EIDL_RXF10EID6_POSN                           0x6
#define _RXF10EIDL_RXF10EID6_POSITION                       0x6
#define _RXF10EIDL_RXF10EID6_SIZE                           0x1
#define _RXF10EIDL_RXF10EID6_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID6_MASK                           0x40
#define _RXF10EIDL_RXF10EID7_POSN                           0x7
#define _RXF10EIDL_RXF10EID7_POSITION                       0x7
#define _RXF10EIDL_RXF10EID7_SIZE                           0x1
#define _RXF10EIDL_RXF10EID7_LENGTH                         0x1
#define _RXF10EIDL_RXF10EID7_MASK                           0x80

// Register: RXF11SIDH
#define RXF11SIDH RXF11SIDH
extern volatile unsigned char           RXF11SIDH           __at(0xE5C);
#ifndef _LIB_BUILD
asm("RXF11SIDH equ 0E5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXFSID                 :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF11SID3              :1;
        unsigned RXF11SID4              :1;
        unsigned RXF11SID5              :1;
        unsigned RXF11SID6              :1;
        unsigned RXF11SID7              :1;
        unsigned RXF11SID8              :1;
        unsigned RXF11SID9              :1;
        unsigned RXF11SID10             :1;
    };
} RXF11SIDHbits_t;
