MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
// Register: B0D7
#define B0D7 B0D7
extern volatile unsigned char           B0D7                __at(0xE8D);
#ifndef _LIB_BUILD
asm("B0D7 equ 0E8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D7                   :8;
    };
    struct {
        unsigned B0D70                  :1;
        unsigned B0D71                  :1;
        unsigned B0D72                  :1;
        unsigned B0D73                  :1;
        unsigned B0D74                  :1;
        unsigned B0D75                  :1;
        unsigned B0D76                  :1;
        unsigned B0D77                  :1;
    };
} B0D7bits_t;
extern volatile B0D7bits_t B0D7bits __at(0xE8D);
// bitfield macros
#define _B0D7_B0D7_POSN                                     0x0
#define _B0D7_B0D7_POSITION                                 0x0
#define _B0D7_B0D7_SIZE                                     0x8
#define _B0D7_B0D7_LENGTH                                   0x8
#define _B0D7_B0D7_MASK                                     0xFF
#define _B0D7_B0D70_POSN                                    0x0
#define _B0D7_B0D70_POSITION                                0x0
#define _B0D7_B0D70_SIZE                                    0x1
#define _B0D7_B0D70_LENGTH                                  0x1
#define _B0D7_B0D70_MASK                                    0x1
#define _B0D7_B0D71_POSN                                    0x1
#define _B0D7_B0D71_POSITION                                0x1
#define _B0D7_B0D71_SIZE                                    0x1
#define _B0D7_B0D71_LENGTH                                  0x1
#define _B0D7_B0D71_MASK                                    0x2
#define _B0D7_B0D72_POSN                                    0x2
#define _B0D7_B0D72_POSITION                                0x2
#define _B0D7_B0D72_SIZE                                    0x1
#define _B0D7_B0D72_LENGTH                                  0x1
#define _B0D7_B0D72_MASK                                    0x4
#define _B0D7_B0D73_POSN                                    0x3
#define _B0D7_B0D73_POSITION                                0x3
#define _B0D7_B0D73_SIZE                                    0x1
#define _B0D7_B0D73_LENGTH                                  0x1
#define _B0D7_B0D73_MASK                                    0x8
#define _B0D7_B0D74_POSN                                    0x4
#define _B0D7_B0D74_POSITION                                0x4
#define _B0D7_B0D74_SIZE                                    0x1
#define _B0D7_B0D74_LENGTH                                  0x1
#define _B0D7_B0D74_MASK                                    0x10
#define _B0D7_B0D75_POSN                                    0x5
#define _B0D7_B0D75_POSITION                                0x5
#define _B0D7_B0D75_SIZE                                    0x1
#define _B0D7_B0D75_LENGTH                                  0x1
#define _B0D7_B0D75_MASK                                    0x20
#define _B0D7_B0D76_POSN                                    0x6
#define _B0D7_B0D76_POSITION                                0x6
#define _B0D7_B0D76_SIZE                                    0x1
#define _B0D7_B0D76_LENGTH                                  0x1
#define _B0D7_B0D76_MASK                                    0x40
#define _B0D7_B0D77_POSN                                    0x7
#define _B0D7_B0D77_POSITION                                0x7
#define _B0D7_B0D77_SIZE                                    0x1
#define _B0D7_B0D77_LENGTH                                  0x1
#define _B0D7_B0D77_MASK                                    0x80

// Register: CANSTAT_RO9
#define CANSTAT_RO9 CANSTAT_RO9
extern volatile unsigned char           CANSTAT_RO9         __at(0xE8E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO9 equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO9bits_t;
extern volatile CANSTAT_RO9bits_t CANSTAT_RO9bits __at(0xE8E);
// bitfield macros
#define _CANSTAT_RO9_EICODE0_POSN                           0x0
#define _CANSTAT_RO9_EICODE0_POSITION                       0x0
#define _CANSTAT_RO9_EICODE0_SIZE                           0x1
#define _CANSTAT_RO9_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO9_EICODE0_MASK                           0x1
#define _CANSTAT_RO9_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO9_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO9_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO9_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO9_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO9_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO9_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO9_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO9_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO9_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO9_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO9_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO9_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO9_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO9_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO9_EICODE4_POSN                           0x4
#define _CANSTAT_RO9_EICODE4_POSITION                       0x4
#define _CANSTAT_RO9_EICODE4_SIZE                           0x1
#define _CANSTAT_RO9_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO9_EICODE4_MASK                           0x10
#define _CANSTAT_RO9_OPMODE_POSN                            0x5
#define _CANSTAT_RO9_OPMODE_POSITION                        0x5
#define _CANSTAT_RO9_OPMODE_SIZE                            0x3
#define _CANSTAT_RO9_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO9_OPMODE_MASK                            0xE0
#define _CANSTAT_RO9_EICODE1_POSN                           0x1
#define _CANSTAT_RO9_EICODE1_POSITION                       0x1
#define _CANSTAT_RO9_EICODE1_SIZE                           0x1
#define _CANSTAT_RO9_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO9_EICODE1_MASK                           0x2
#define _CANSTAT_RO9_EICODE2_POSN                           0x2
#define _CANSTAT_RO9_EICODE2_POSITION                       0x2
#define _CANSTAT_RO9_EICODE2_SIZE                           0x1
#define _CANSTAT_RO9_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO9_EICODE2_MASK                           0x4
#define _CANSTAT_RO9_EICODE3_POSN                           0x3
#define _CANSTAT_RO9_EICODE3_POSITION                       0x3
#define _CANSTAT_RO9_EICODE3_SIZE                           0x1
#define _CANSTAT_RO9_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO9_EICODE3_MASK                           0x8
#define _CANSTAT_RO9_OPMODE0_POSN                           0x5
#define _CANSTAT_RO9_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO9_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO9_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO9_OPMODE0_MASK                           0x20
#define _CANSTAT_RO9_OPMODE1_POSN                           0x6
#define _CANSTAT_RO9_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO9_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO9_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO9_OPMODE1_MASK                           0x40
#define _CANSTAT_RO9_OPMODE2_POSN                           0x7
#define _CANSTAT_RO9_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO9_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO9_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO9_OPMODE2_MASK                           0x80
#define _CANSTAT_RO9_ICODE0_POSN                            0x1
#define _CANSTAT_RO9_ICODE0_POSITION                        0x1
#define _CANSTAT_RO9_ICODE0_SIZE                            0x1
#define _CANSTAT_RO9_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO9_ICODE0_MASK                            0x2
#define _CANSTAT_RO9_ICODE1_POSN                            0x2
#define _CANSTAT_RO9_ICODE1_POSITION                        0x2
#define _CANSTAT_RO9_ICODE1_SIZE                            0x1
#define _CANSTAT_RO9_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO9_ICODE1_MASK                            0x4
#define _CANSTAT_RO9_ICODE2_POSN                            0x3
#define _CANSTAT_RO9_ICODE2_POSITION                        0x3
#define _CANSTAT_RO9_ICODE2_SIZE                            0x1
#define _CANSTAT_RO9_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO9_ICODE2_MASK                            0x8

// Register: CANCON_RO9
#define CANCON_RO9 CANCON_RO9
extern volatile unsigned char           CANCON_RO9          __at(0xE8F);
#ifndef _LIB_BUILD
asm("CANCON_RO9 equ 0E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO9bits_t;
