MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
// Register: CANSTAT_RO8
#define CANSTAT_RO8 CANSTAT_RO8
extern volatile unsigned char           CANSTAT_RO8         __at(0xE9E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO8 equ 0E9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO8bits_t;
extern volatile CANSTAT_RO8bits_t CANSTAT_RO8bits __at(0xE9E);
// bitfield macros
#define _CANSTAT_RO8_EICODE0_POSN                           0x0
#define _CANSTAT_RO8_EICODE0_POSITION                       0x0
#define _CANSTAT_RO8_EICODE0_SIZE                           0x1
#define _CANSTAT_RO8_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE0_MASK                           0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO8_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO8_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO8_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO8_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO8_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO8_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO8_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO8_EICODE4_POSN                           0x4
#define _CANSTAT_RO8_EICODE4_POSITION                       0x4
#define _CANSTAT_RO8_EICODE4_SIZE                           0x1
#define _CANSTAT_RO8_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE4_MASK                           0x10
#define _CANSTAT_RO8_OPMODE_POSN                            0x5
#define _CANSTAT_RO8_OPMODE_POSITION                        0x5
#define _CANSTAT_RO8_OPMODE_SIZE                            0x3
#define _CANSTAT_RO8_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO8_OPMODE_MASK                            0xE0
#define _CANSTAT_RO8_EICODE1_POSN                           0x1
#define _CANSTAT_RO8_EICODE1_POSITION                       0x1
#define _CANSTAT_RO8_EICODE1_SIZE                           0x1
#define _CANSTAT_RO8_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE1_MASK                           0x2
#define _CANSTAT_RO8_EICODE2_POSN                           0x2
#define _CANSTAT_RO8_EICODE2_POSITION                       0x2
#define _CANSTAT_RO8_EICODE2_SIZE                           0x1
#define _CANSTAT_RO8_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE2_MASK                           0x4
#define _CANSTAT_RO8_EICODE3_POSN                           0x3
#define _CANSTAT_RO8_EICODE3_POSITION                       0x3
#define _CANSTAT_RO8_EICODE3_SIZE                           0x1
#define _CANSTAT_RO8_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO8_EICODE3_MASK                           0x8
#define _CANSTAT_RO8_OPMODE0_POSN                           0x5
#define _CANSTAT_RO8_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO8_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE0_MASK                           0x20
#define _CANSTAT_RO8_OPMODE1_POSN                           0x6
#define _CANSTAT_RO8_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO8_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE1_MASK                           0x40
#define _CANSTAT_RO8_OPMODE2_POSN                           0x7
#define _CANSTAT_RO8_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO8_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO8_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO8_OPMODE2_MASK                           0x80
#define _CANSTAT_RO8_ICODE0_POSN                            0x1
#define _CANSTAT_RO8_ICODE0_POSITION                        0x1
#define _CANSTAT_RO8_ICODE0_SIZE                            0x1
#define _CANSTAT_RO8_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE0_MASK                            0x2
#define _CANSTAT_RO8_ICODE1_POSN                            0x2
#define _CANSTAT_RO8_ICODE1_POSITION                        0x2
#define _CANSTAT_RO8_ICODE1_SIZE                            0x1
#define _CANSTAT_RO8_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE1_MASK                            0x4
#define _CANSTAT_RO8_ICODE2_POSN                            0x3
#define _CANSTAT_RO8_ICODE2_POSITION                        0x3
#define _CANSTAT_RO8_ICODE2_SIZE                            0x1
#define _CANSTAT_RO8_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO8_ICODE2_MASK                            0x8

// Register: CANCON_RO8
#define CANCON_RO8 CANCON_RO8
extern volatile unsigned char           CANCON_RO8          __at(0xE9F);
#ifndef _LIB_BUILD
asm("CANCON_RO8 equ 0E9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO8bits_t;
