MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile CANCON_RO8bits_t CANCON_RO8bits __at(0xE9F);
// bitfield macros
#define _CANCON_RO8_FP0_POSN                                0x0
#define _CANCON_RO8_FP0_POSITION                            0x0
#define _CANCON_RO8_FP0_SIZE                                0x1
#define _CANCON_RO8_FP0_LENGTH                              0x1
#define _CANCON_RO8_FP0_MASK                                0x1
#define _CANCON_RO8_WIN0_FP1_POSN                           0x1
#define _CANCON_RO8_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO8_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO8_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO8_WIN0_FP1_MASK                           0x2
#define _CANCON_RO8_WIN1_FP2_POSN                           0x2
#define _CANCON_RO8_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO8_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO8_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO8_WIN1_FP2_MASK                           0x4
#define _CANCON_RO8_WIN2_FP3_POSN                           0x3
#define _CANCON_RO8_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO8_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO8_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO8_WIN2_FP3_MASK                           0x8
#define _CANCON_RO8_ABAT_POSN                               0x4
#define _CANCON_RO8_ABAT_POSITION                           0x4
#define _CANCON_RO8_ABAT_SIZE                               0x1
#define _CANCON_RO8_ABAT_LENGTH                             0x1
#define _CANCON_RO8_ABAT_MASK                               0x10
#define _CANCON_RO8_REQOP_POSN                              0x5
#define _CANCON_RO8_REQOP_POSITION                          0x5
#define _CANCON_RO8_REQOP_SIZE                              0x3
#define _CANCON_RO8_REQOP_LENGTH                            0x3
#define _CANCON_RO8_REQOP_MASK                              0xE0
#define _CANCON_RO8_WIN0_POSN                               0x1
#define _CANCON_RO8_WIN0_POSITION                           0x1
#define _CANCON_RO8_WIN0_SIZE                               0x1
#define _CANCON_RO8_WIN0_LENGTH                             0x1
#define _CANCON_RO8_WIN0_MASK                               0x2
#define _CANCON_RO8_WIN1_POSN                               0x2
#define _CANCON_RO8_WIN1_POSITION                           0x2
#define _CANCON_RO8_WIN1_SIZE                               0x1
#define _CANCON_RO8_WIN1_LENGTH                             0x1
#define _CANCON_RO8_WIN1_MASK                               0x4
#define _CANCON_RO8_WIN2_POSN                               0x3
#define _CANCON_RO8_WIN2_POSITION                           0x3
#define _CANCON_RO8_WIN2_SIZE                               0x1
#define _CANCON_RO8_WIN2_LENGTH                             0x1
#define _CANCON_RO8_WIN2_MASK                               0x8
#define _CANCON_RO8_FP1_POSN                                0x1
#define _CANCON_RO8_FP1_POSITION                            0x1
#define _CANCON_RO8_FP1_SIZE                                0x1
#define _CANCON_RO8_FP1_LENGTH                              0x1
#define _CANCON_RO8_FP1_MASK                                0x2
#define _CANCON_RO8_FP2_POSN                                0x2
#define _CANCON_RO8_FP2_POSITION                            0x2
#define _CANCON_RO8_FP2_SIZE                                0x1
#define _CANCON_RO8_FP2_LENGTH                              0x1
#define _CANCON_RO8_FP2_MASK                                0x4
#define _CANCON_RO8_FP3_POSN                                0x3
#define _CANCON_RO8_FP3_POSITION                            0x3
#define _CANCON_RO8_FP3_SIZE                                0x1
#define _CANCON_RO8_FP3_LENGTH                              0x1
#define _CANCON_RO8_FP3_MASK                                0x8

// Register: B2CON
#define B2CON B2CON
extern volatile unsigned char           B2CON               __at(0xEA0);
#ifndef _LIB_BUILD
asm("B2CON equ 0EA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RXRTRRO                :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned B2FILHIT0              :1;
        unsigned B2FILHIT1              :1;
        unsigned B2FILHIT2              :1;
        unsigned B2FILHIT3              :1;
        unsigned B2FILHIT4              :1;
        unsigned B2RTRRO                :1;
        unsigned B2RXM1                 :1;
        unsigned B2RXFUL                :1;
    };
    struct {
        unsigned B2TXPRI0               :1;
        unsigned B2TXPRI1               :1;
        unsigned B2RTREN                :1;
        unsigned B2TXREQ                :1;
        unsigned B2TXERR                :1;
        unsigned B2TXLARB               :1;
        unsigned B2TXABT                :1;
        unsigned B2TXB3IF               :1;
    };
} B2CONbits_t;
extern volatile B2CONbits_t B2CONbits __at(0xEA0);
// bitfield macros
#define _B2CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B2CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B2CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B2CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B2CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B2CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B2CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B2CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B2CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B2CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B2CON_FILHIT2_RTREN_POSN                           0x2
#define _B2CON_FILHIT2_RTREN_POSITION                       0x2
#define _B2CON_FILHIT2_RTREN_SIZE                           0x1
#define _B2CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B2CON_FILHIT2_RTREN_MASK                           0x4
#define _B2CON_FILHIT3_TXREQ_POSN                           0x3
#define _B2CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B2CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B2CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B2CON_FILHIT3_TXREQ_MASK                           0x8
#define _B2CON_FILHIT4_TXERR_POSN                           0x4
#define _B2CON_FILHIT4_TXERR_POSITION                       0x4
#define _B2CON_FILHIT4_TXERR_SIZE                           0x1
#define _B2CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B2CON_FILHIT4_TXERR_MASK                           0x10
#define _B2CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B2CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B2CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B2CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B2CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B2CON_RXM1_TXABT_POSN                              0x6
#define _B2CON_RXM1_TXABT_POSITION                          0x6
#define _B2CON_RXM1_TXABT_SIZE                              0x1
#define _B2CON_RXM1_TXABT_LENGTH                            0x1
#define _B2CON_RXM1_TXABT_MASK                              0x40
#define _B2CON_RXFUL_TXBIF_POSN                             0x7
#define _B2CON_RXFUL_TXBIF_POSITION                         0x7
#define _B2CON_RXFUL_TXBIF_SIZE                             0x1
#define _B2CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B2CON_RXFUL_TXBIF_MASK                             0x80
#define _B2CON_FILHIT0_POSN                                 0x0
#define _B2CON_FILHIT0_POSITION                             0x0
#define _B2CON_FILHIT0_SIZE                                 0x1
#define _B2CON_FILHIT0_LENGTH                               0x1
#define _B2CON_FILHIT0_MASK                                 0x1
#define _B2CON_FILHIT1_POSN                                 0x1
#define _B2CON_FILHIT1_POSITION                             0x1
#define _B2CON_FILHIT1_SIZE                                 0x1
#define _B2CON_FILHIT1_LENGTH                               0x1
#define _B2CON_FILHIT1_MASK                                 0x2
#define _B2CON_FILHIT2_POSN                                 0x2
#define _B2CON_FILHIT2_POSITION                             0x2
#define _B2CON_FILHIT2_SIZE                                 0x1
#define _B2CON_FILHIT2_LENGTH                               0x1
#define _B2CON_FILHIT2_MASK                                 0x4
#define _B2CON_FILHIT3_POSN                                 0x3
#define _B2CON_FILHIT3_POSITION                             0x3
#define _B2CON_FILHIT3_SIZE                                 0x1
#define _B2CON_FILHIT3_LENGTH                               0x1
#define _B2CON_FILHIT3_MASK                                 0x8
#define _B2CON_FILHIT4_POSN                                 0x4
#define _B2CON_FILHIT4_POSITION                             0x4
#define _B2CON_FILHIT4_SIZE                                 0x1
#define _B2CON_FILHIT4_LENGTH                               0x1
#define _B2CON_FILHIT4_MASK                                 0x10
#define _B2CON_RXRTRRO_POSN                                 0x5
#define _B2CON_RXRTRRO_POSITION                             0x5
#define _B2CON_RXRTRRO_SIZE                                 0x1
#define _B2CON_RXRTRRO_LENGTH                               0x1
#define _B2CON_RXRTRRO_MASK                                 0x20
#define _B2CON_RXM1_POSN                                    0x6
#define _B2CON_RXM1_POSITION                                0x6
#define _B2CON_RXM1_SIZE                                    0x1
#define _B2CON_RXM1_LENGTH                                  0x1
#define _B2CON_RXM1_MASK                                    0x40
#define _B2CON_RXFUL_POSN                                   0x7
#define _B2CON_RXFUL_POSITION                               0x7
#define _B2CON_RXFUL_SIZE                                   0x1
#define _B2CON_RXFUL_LENGTH                                 0x1
#define _B2CON_RXFUL_MASK                                   0x80
#define _B2CON_TXPRI0_POSN                                  0x0
#define _B2CON_TXPRI0_POSITION                              0x0
#define _B2CON_TXPRI0_SIZE                                  0x1
#define _B2CON_TXPRI0_LENGTH                                0x1
#define _B2CON_TXPRI0_MASK                                  0x1
#define _B2CON_TXPRI1_POSN                                  0x1
#define _B2CON_TXPRI1_POSITION                              0x1
#define _B2CON_TXPRI1_SIZE                                  0x1
#define _B2CON_TXPRI1_LENGTH                                0x1
#define _B2CON_TXPRI1_MASK                                  0x2
#define _B2CON_RTREN_POSN                                   0x2
#define _B2CON_RTREN_POSITION                               0x2
#define _B2CON_RTREN_SIZE                                   0x1
#define _B2CON_RTREN_LENGTH                                 0x1
#define _B2CON_RTREN_MASK                                   0x4
#define _B2CON_TXREQ_POSN                                   0x3
#define _B2CON_TXREQ_POSITION                               0x3
#define _B2CON_TXREQ_SIZE                                   0x1
#define _B2CON_TXREQ_LENGTH                                 0x1
#define _B2CON_TXREQ_MASK                                   0x8
#define _B2CON_TXERR_POSN                                   0x4
#define _B2CON_TXERR_POSITION                               0x4
#define _B2CON_TXERR_SIZE                                   0x1
#define _B2CON_TXERR_LENGTH                                 0x1
#define _B2CON_TXERR_MASK                                   0x10
#define _B2CON_TXLARB_POSN                                  0x5
#define _B2CON_TXLARB_POSITION                              0x5
#define _B2CON_TXLARB_SIZE                                  0x1
#define _B2CON_TXLARB_LENGTH                                0x1
#define _B2CON_TXLARB_MASK                                  0x20
#define _B2CON_TXABT_POSN                                   0x6
#define _B2CON_TXABT_POSITION                               0x6
#define _B2CON_TXABT_SIZE                                   0x1
#define _B2CON_TXABT_LENGTH                                 0x1
#define _B2CON_TXABT_MASK                                   0x40
#define _B2CON_TXBIF_POSN                                   0x7
#define _B2CON_TXBIF_POSITION                               0x7
#define _B2CON_TXBIF_SIZE                                   0x1
#define _B2CON_TXBIF_LENGTH                                 0x1
#define _B2CON_TXBIF_MASK                                   0x80
#define _B2CON_B2FILHIT0_POSN                               0x0
#define _B2CON_B2FILHIT0_POSITION                           0x0
#define _B2CON_B2FILHIT0_SIZE                               0x1
#define _B2CON_B2FILHIT0_LENGTH                             0x1
#define _B2CON_B2FILHIT0_MASK                               0x1
#define _B2CON_B2FILHIT1_POSN                               0x1
#define _B2CON_B2FILHIT1_POSITION                           0x1
#define _B2CON_B2FILHIT1_SIZE                               0x1
#define _B2CON_B2FILHIT1_LENGTH                             0x1
#define _B2CON_B2FILHIT1_MASK                               0x2
#define _B2CON_B2FILHIT2_POSN                               0x2
#define _B2CON_B2FILHIT2_POSITION                           0x2
#define _B2CON_B2FILHIT2_SIZE                               0x1
#define _B2CON_B2FILHIT2_LENGTH                             0x1
#define _B2CON_B2FILHIT2_MASK                               0x4
#define _B2CON_B2FILHIT3_POSN                               0x3
#define _B2CON_B2FILHIT3_POSITION                           0x3
#define _B2CON_B2FILHIT3_SIZE                               0x1
#define _B2CON_B2FILHIT3_LENGTH                             0x1
#define _B2CON_B2FILHIT3_MASK                               0x8
#define _B2CON_B2FILHIT4_POSN                               0x4
#define _B2CON_B2FILHIT4_POSITION                           0x4
#define _B2CON_B2FILHIT4_SIZE                               0x1
#define _B2CON_B2FILHIT4_LENGTH                             0x1
#define _B2CON_B2FILHIT4_MASK                               0x10
#define _B2CON_B2RTRRO_POSN                                 0x5
#define _B2CON_B2RTRRO_POSITION                             0x5
#define _B2CON_B2RTRRO_SIZE                                 0x1
#define _B2CON_B2RTRRO_LENGTH                               0x1
#define _B2CON_B2RTRRO_MASK                                 0x20
#define _B2CON_B2RXM1_POSN                                  0x6
#define _B2CON_B2RXM1_POSITION                              0x6
#define _B2CON_B2RXM1_SIZE                                  0x1
#define _B2CON_B2RXM1_LENGTH                                0x1
#define _B2CON_B2RXM1_MASK                                  0x40
#define _B2CON_B2RXFUL_POSN                                 0x7
#define _B2CON_B2RXFUL_POSITION                             0x7
#define _B2CON_B2RXFUL_SIZE                                 0x1
#define _B2CON_B2RXFUL_LENGTH                               0x1
#define _B2CON_B2RXFUL_MASK                                 0x80
#define _B2CON_B2TXPRI0_POSN                                0x0
#define _B2CON_B2TXPRI0_POSITION                            0x0
#define _B2CON_B2TXPRI0_SIZE                                0x1
#define _B2CON_B2TXPRI0_LENGTH                              0x1
#define _B2CON_B2TXPRI0_MASK                                0x1
#define _B2CON_B2TXPRI1_POSN                                0x1
#define _B2CON_B2TXPRI1_POSITION                            0x1
#define _B2CON_B2TXPRI1_SIZE                                0x1
#define _B2CON_B2TXPRI1_LENGTH                              0x1
#define _B2CON_B2TXPRI1_MASK                                0x2
#define _B2CON_B2RTREN_POSN                                 0x2
#define _B2CON_B2RTREN_POSITION                             0x2
#define _B2CON_B2RTREN_SIZE                                 0x1
#define _B2CON_B2RTREN_LENGTH                               0x1
#define _B2CON_B2RTREN_MASK                                 0x4
#define _B2CON_B2TXREQ_POSN                                 0x3
#define _B2CON_B2TXREQ_POSITION                             0x3
#define _B2CON_B2TXREQ_SIZE                                 0x1
#define _B2CON_B2TXREQ_LENGTH                               0x1
#define _B2CON_B2TXREQ_MASK                                 0x8
#define _B2CON_B2TXERR_POSN                                 0x4
#define _B2CON_B2TXERR_POSITION                             0x4
#define _B2CON_B2TXERR_SIZE                                 0x1
#define _B2CON_B2TXERR_LENGTH                               0x1
#define _B2CON_B2TXERR_MASK                                 0x10
#define _B2CON_B2TXLARB_POSN                                0x5
#define _B2CON_B2TXLARB_POSITION                            0x5
#define _B2CON_B2TXLARB_SIZE                                0x1
#define _B2CON_B2TXLARB_LENGTH                              0x1
#define _B2CON_B2TXLARB_MASK                                0x20
#define _B2CON_B2TXABT_POSN                                 0x6
#define _B2CON_B2TXABT_POSITION                             0x6
#define _B2CON_B2TXABT_SIZE                                 0x1
#define _B2CON_B2TXABT_LENGTH                               0x1
#define _B2CON_B2TXABT_MASK                                 0x40
#define _B2CON_B2TXB3IF_POSN                                0x7
#define _B2CON_B2TXB3IF_POSITION                            0x7
#define _B2CON_B2TXB3IF_SIZE                                0x1
#define _B2CON_B2TXB3IF_LENGTH                              0x1
#define _B2CON_B2TXB3IF_MASK                                0x80

// Register: B2SIDH
#define B2SIDH B2SIDH
extern volatile unsigned char           B2SIDH              __at(0xEA1);
#ifndef _LIB_BUILD
asm("B2SIDH equ 0EA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B2SID3                 :1;
        unsigned B2SID4                 :1;
        unsigned B2SID5                 :1;
        unsigned B2SID6                 :1;
        unsigned B2SID7                 :1;
        unsigned B2SID8                 :1;
        unsigned B2SID9                 :1;
        unsigned B2SID10                :1;
    };
} B2SIDHbits_t;
