MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
// Register: B4D5
#define B4D5 B4D5
extern volatile unsigned char           B4D5                __at(0xECB);
#ifndef _LIB_BUILD
asm("B4D5 equ 0ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D5                   :8;
    };
    struct {
        unsigned B4D50                  :1;
        unsigned B4D51                  :1;
        unsigned B4D52                  :1;
        unsigned B4D53                  :1;
        unsigned B4D54                  :1;
        unsigned B4D55                  :1;
        unsigned B4D56                  :1;
        unsigned B4D57                  :1;
    };
} B4D5bits_t;
extern volatile B4D5bits_t B4D5bits __at(0xECB);
// bitfield macros
#define _B4D5_B4D5_POSN                                     0x0
#define _B4D5_B4D5_POSITION                                 0x0
#define _B4D5_B4D5_SIZE                                     0x8
#define _B4D5_B4D5_LENGTH                                   0x8
#define _B4D5_B4D5_MASK                                     0xFF
#define _B4D5_B4D50_POSN                                    0x0
#define _B4D5_B4D50_POSITION                                0x0
#define _B4D5_B4D50_SIZE                                    0x1
#define _B4D5_B4D50_LENGTH                                  0x1
#define _B4D5_B4D50_MASK                                    0x1
#define _B4D5_B4D51_POSN                                    0x1
#define _B4D5_B4D51_POSITION                                0x1
#define _B4D5_B4D51_SIZE                                    0x1
#define _B4D5_B4D51_LENGTH                                  0x1
#define _B4D5_B4D51_MASK                                    0x2
#define _B4D5_B4D52_POSN                                    0x2
#define _B4D5_B4D52_POSITION                                0x2
#define _B4D5_B4D52_SIZE                                    0x1
#define _B4D5_B4D52_LENGTH                                  0x1
#define _B4D5_B4D52_MASK                                    0x4
#define _B4D5_B4D53_POSN                                    0x3
#define _B4D5_B4D53_POSITION                                0x3
#define _B4D5_B4D53_SIZE                                    0x1
#define _B4D5_B4D53_LENGTH                                  0x1
#define _B4D5_B4D53_MASK                                    0x8
#define _B4D5_B4D54_POSN                                    0x4
#define _B4D5_B4D54_POSITION                                0x4
#define _B4D5_B4D54_SIZE                                    0x1
#define _B4D5_B4D54_LENGTH                                  0x1
#define _B4D5_B4D54_MASK                                    0x10
#define _B4D5_B4D55_POSN                                    0x5
#define _B4D5_B4D55_POSITION                                0x5
#define _B4D5_B4D55_SIZE                                    0x1
#define _B4D5_B4D55_LENGTH                                  0x1
#define _B4D5_B4D55_MASK                                    0x20
#define _B4D5_B4D56_POSN                                    0x6
#define _B4D5_B4D56_POSITION                                0x6
#define _B4D5_B4D56_SIZE                                    0x1
#define _B4D5_B4D56_LENGTH                                  0x1
#define _B4D5_B4D56_MASK                                    0x40
#define _B4D5_B4D57_POSN                                    0x7
#define _B4D5_B4D57_POSITION                                0x7
#define _B4D5_B4D57_SIZE                                    0x1
#define _B4D5_B4D57_LENGTH                                  0x1
#define _B4D5_B4D57_MASK                                    0x80

// Register: B4D6
#define B4D6 B4D6
extern volatile unsigned char           B4D6                __at(0xECC);
#ifndef _LIB_BUILD
asm("B4D6 equ 0ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D6                   :8;
    };
    struct {
        unsigned B4D60                  :1;
        unsigned B4D61                  :1;
        unsigned B4D62                  :1;
        unsigned B4D63                  :1;
        unsigned B4D64                  :1;
        unsigned B4D65                  :1;
        unsigned B4D66                  :1;
        unsigned B4D67                  :1;
    };
} B4D6bits_t;
extern volatile B4D6bits_t B4D6bits __at(0xECC);
// bitfield macros
#define _B4D6_B4D6_POSN                                     0x0
#define _B4D6_B4D6_POSITION                                 0x0
#define _B4D6_B4D6_SIZE                                     0x8
#define _B4D6_B4D6_LENGTH                                   0x8
#define _B4D6_B4D6_MASK                                     0xFF
#define _B4D6_B4D60_POSN                                    0x0
#define _B4D6_B4D60_POSITION                                0x0
#define _B4D6_B4D60_SIZE                                    0x1
#define _B4D6_B4D60_LENGTH                                  0x1
#define _B4D6_B4D60_MASK                                    0x1
#define _B4D6_B4D61_POSN                                    0x1
#define _B4D6_B4D61_POSITION                                0x1
#define _B4D6_B4D61_SIZE                                    0x1
#define _B4D6_B4D61_LENGTH                                  0x1
#define _B4D6_B4D61_MASK                                    0x2
#define _B4D6_B4D62_POSN                                    0x2
#define _B4D6_B4D62_POSITION                                0x2
#define _B4D6_B4D62_SIZE                                    0x1
#define _B4D6_B4D62_LENGTH                                  0x1
#define _B4D6_B4D62_MASK                                    0x4
#define _B4D6_B4D63_POSN                                    0x3
#define _B4D6_B4D63_POSITION                                0x3
#define _B4D6_B4D63_SIZE                                    0x1
#define _B4D6_B4D63_LENGTH                                  0x1
#define _B4D6_B4D63_MASK                                    0x8
#define _B4D6_B4D64_POSN                                    0x4
#define _B4D6_B4D64_POSITION                                0x4
#define _B4D6_B4D64_SIZE                                    0x1
#define _B4D6_B4D64_LENGTH                                  0x1
#define _B4D6_B4D64_MASK                                    0x10
#define _B4D6_B4D65_POSN                                    0x5
#define _B4D6_B4D65_POSITION                                0x5
#define _B4D6_B4D65_SIZE                                    0x1
#define _B4D6_B4D65_LENGTH                                  0x1
#define _B4D6_B4D65_MASK                                    0x20
#define _B4D6_B4D66_POSN                                    0x6
#define _B4D6_B4D66_POSITION                                0x6
#define _B4D6_B4D66_SIZE                                    0x1
#define _B4D6_B4D66_LENGTH                                  0x1
#define _B4D6_B4D66_MASK                                    0x40
#define _B4D6_B4D67_POSN                                    0x7
#define _B4D6_B4D67_POSITION                                0x7
#define _B4D6_B4D67_SIZE                                    0x1
#define _B4D6_B4D67_LENGTH                                  0x1
#define _B4D6_B4D67_MASK                                    0x80

