MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
// Register: CANCON_RO4
#define CANCON_RO4 CANCON_RO4
extern volatile unsigned char           CANCON_RO4          __at(0xEDF);
#ifndef _LIB_BUILD
asm("CANCON_RO4 equ 0EDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO4bits_t;
extern volatile CANCON_RO4bits_t CANCON_RO4bits __at(0xEDF);
// bitfield macros
#define _CANCON_RO4_FP0_POSN                                0x0
#define _CANCON_RO4_FP0_POSITION                            0x0
#define _CANCON_RO4_FP0_SIZE                                0x1
#define _CANCON_RO4_FP0_LENGTH                              0x1
#define _CANCON_RO4_FP0_MASK                                0x1
#define _CANCON_RO4_WIN0_FP1_POSN                           0x1
#define _CANCON_RO4_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO4_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO4_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO4_WIN0_FP1_MASK                           0x2
#define _CANCON_RO4_WIN1_FP2_POSN                           0x2
#define _CANCON_RO4_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO4_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO4_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO4_WIN1_FP2_MASK                           0x4
#define _CANCON_RO4_WIN2_FP3_POSN                           0x3
#define _CANCON_RO4_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO4_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO4_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO4_WIN2_FP3_MASK                           0x8
#define _CANCON_RO4_ABAT_POSN                               0x4
#define _CANCON_RO4_ABAT_POSITION                           0x4
#define _CANCON_RO4_ABAT_SIZE                               0x1
#define _CANCON_RO4_ABAT_LENGTH                             0x1
#define _CANCON_RO4_ABAT_MASK                               0x10
#define _CANCON_RO4_REQOP_POSN                              0x5
#define _CANCON_RO4_REQOP_POSITION                          0x5
#define _CANCON_RO4_REQOP_SIZE                              0x3
#define _CANCON_RO4_REQOP_LENGTH                            0x3
#define _CANCON_RO4_REQOP_MASK                              0xE0
#define _CANCON_RO4_WIN0_POSN                               0x1
#define _CANCON_RO4_WIN0_POSITION                           0x1
#define _CANCON_RO4_WIN0_SIZE                               0x1
#define _CANCON_RO4_WIN0_LENGTH                             0x1
#define _CANCON_RO4_WIN0_MASK                               0x2
#define _CANCON_RO4_WIN1_POSN                               0x2
#define _CANCON_RO4_WIN1_POSITION                           0x2
#define _CANCON_RO4_WIN1_SIZE                               0x1
#define _CANCON_RO4_WIN1_LENGTH                             0x1
#define _CANCON_RO4_WIN1_MASK                               0x4
#define _CANCON_RO4_WIN2_POSN                               0x3
#define _CANCON_RO4_WIN2_POSITION                           0x3
#define _CANCON_RO4_WIN2_SIZE                               0x1
#define _CANCON_RO4_WIN2_LENGTH                             0x1
#define _CANCON_RO4_WIN2_MASK                               0x8
#define _CANCON_RO4_FP1_POSN                                0x1
#define _CANCON_RO4_FP1_POSITION                            0x1
#define _CANCON_RO4_FP1_SIZE                                0x1
#define _CANCON_RO4_FP1_LENGTH                              0x1
#define _CANCON_RO4_FP1_MASK                                0x2
#define _CANCON_RO4_FP2_POSN                                0x2
#define _CANCON_RO4_FP2_POSITION                            0x2
#define _CANCON_RO4_FP2_SIZE                                0x1
#define _CANCON_RO4_FP2_LENGTH                              0x1
#define _CANCON_RO4_FP2_MASK                                0x4
#define _CANCON_RO4_FP3_POSN                                0x3
#define _CANCON_RO4_FP3_POSITION                            0x3
#define _CANCON_RO4_FP3_SIZE                                0x1
#define _CANCON_RO4_FP3_LENGTH                              0x1
#define _CANCON_RO4_FP3_MASK                                0x8

// Register: RXF0SIDH
#define RXF0SIDH RXF0SIDH
extern volatile unsigned char           RXF0SIDH            __at(0xEE0);
#ifndef _LIB_BUILD
asm("RXF0SIDH equ 0EE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF0SID3               :1;
        unsigned RXF0SID4               :1;
        unsigned RXF0SID5               :1;
        unsigned RXF0SID6               :1;
        unsigned RXF0SID7               :1;
        unsigned RXF0SID8               :1;
        unsigned RXF0SID9               :1;
        unsigned RXF0SID10              :1;
    };
} RXF0SIDHbits_t;
extern volatile RXF0SIDHbits_t RXF0SIDHbits __at(0xEE0);
// bitfield macros
#define _RXF0SIDH_SID_POSN                                  0x0
#define _RXF0SIDH_SID_POSITION                              0x0
#define _RXF0SIDH_SID_SIZE                                  0x8
#define _RXF0SIDH_SID_LENGTH                                0x8
#define _RXF0SIDH_SID_MASK                                  0xFF
#define _RXF0SIDH_SID3_POSN                                 0x0
#define _RXF0SIDH_SID3_POSITION                             0x0
#define _RXF0SIDH_SID3_SIZE                                 0x1
#define _RXF0SIDH_SID3_LENGTH                               0x1
#define _RXF0SIDH_SID3_MASK                                 0x1
#define _RXF0SIDH_SID4_POSN                                 0x1
#define _RXF0SIDH_SID4_POSITION                             0x1
#define _RXF0SIDH_SID4_SIZE                                 0x1
#define _RXF0SIDH_SID4_LENGTH                               0x1
#define _RXF0SIDH_SID4_MASK                                 0x2
#define _RXF0SIDH_SID5_POSN                                 0x2
#define _RXF0SIDH_SID5_POSITION                             0x2
#define _RXF0SIDH_SID5_SIZE                                 0x1
#define _RXF0SIDH_SID5_LENGTH                               0x1
#define _RXF0SIDH_SID5_MASK                                 0x4
#define _RXF0SIDH_SID6_POSN                                 0x3
#define _RXF0SIDH_SID6_POSITION                             0x3
#define _RXF0SIDH_SID6_SIZE                                 0x1
#define _RXF0SIDH_SID6_LENGTH                               0x1
#define _RXF0SIDH_SID6_MASK                                 0x8
#define _RXF0SIDH_SID7_POSN                                 0x4
#define _RXF0SIDH_SID7_POSITION                             0x4
#define _RXF0SIDH_SID7_SIZE                                 0x1
#define _RXF0SIDH_SID7_LENGTH                               0x1
#define _RXF0SIDH_SID7_MASK                                 0x10
#define _RXF0SIDH_SID8_POSN                                 0x5
#define _RXF0SIDH_SID8_POSITION                             0x5
#define _RXF0SIDH_SID8_SIZE                                 0x1
#define _RXF0SIDH_SID8_LENGTH                               0x1
#define _RXF0SIDH_SID8_MASK                                 0x20
#define _RXF0SIDH_SID9_POSN                                 0x6
#define _RXF0SIDH_SID9_POSITION                             0x6
#define _RXF0SIDH_SID9_SIZE                                 0x1
#define _RXF0SIDH_SID9_LENGTH                               0x1
#define _RXF0SIDH_SID9_MASK                                 0x40
#define _RXF0SIDH_SID10_POSN                                0x7
#define _RXF0SIDH_SID10_POSITION                            0x7
#define _RXF0SIDH_SID10_SIZE                                0x1
#define _RXF0SIDH_SID10_LENGTH                              0x1
#define _RXF0SIDH_SID10_MASK                                0x80
#define _RXF0SIDH_RXF0SID3_POSN                             0x0
#define _RXF0SIDH_RXF0SID3_POSITION                         0x0
#define _RXF0SIDH_RXF0SID3_SIZE                             0x1
#define _RXF0SIDH_RXF0SID3_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID3_MASK                             0x1
#define _RXF0SIDH_RXF0SID4_POSN                             0x1
#define _RXF0SIDH_RXF0SID4_POSITION                         0x1
#define _RXF0SIDH_RXF0SID4_SIZE                             0x1
#define _RXF0SIDH_RXF0SID4_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID4_MASK                             0x2
#define _RXF0SIDH_RXF0SID5_POSN                             0x2
#define _RXF0SIDH_RXF0SID5_POSITION                         0x2
#define _RXF0SIDH_RXF0SID5_SIZE                             0x1
#define _RXF0SIDH_RXF0SID5_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID5_MASK                             0x4
#define _RXF0SIDH_RXF0SID6_POSN                             0x3
#define _RXF0SIDH_RXF0SID6_POSITION                         0x3
#define _RXF0SIDH_RXF0SID6_SIZE                             0x1
#define _RXF0SIDH_RXF0SID6_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID6_MASK                             0x8
#define _RXF0SIDH_RXF0SID7_POSN                             0x4
#define _RXF0SIDH_RXF0SID7_POSITION                         0x4
#define _RXF0SIDH_RXF0SID7_SIZE                             0x1
#define _RXF0SIDH_RXF0SID7_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID7_MASK                             0x10
#define _RXF0SIDH_RXF0SID8_POSN                             0x5
#define _RXF0SIDH_RXF0SID8_POSITION                         0x5
#define _RXF0SIDH_RXF0SID8_SIZE                             0x1
#define _RXF0SIDH_RXF0SID8_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID8_MASK                             0x20
#define _RXF0SIDH_RXF0SID9_POSN                             0x6
#define _RXF0SIDH_RXF0SID9_POSITION                         0x6
#define _RXF0SIDH_RXF0SID9_SIZE                             0x1
#define _RXF0SIDH_RXF0SID9_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID9_MASK                             0x40
#define _RXF0SIDH_RXF0SID10_POSN                            0x7
#define _RXF0SIDH_RXF0SID10_POSITION                        0x7
#define _RXF0SIDH_RXF0SID10_SIZE                            0x1
#define _RXF0SIDH_RXF0SID10_LENGTH                          0x1
#define _RXF0SIDH_RXF0SID10_MASK                            0x80

// Register: RXF0SIDL
#define RXF0SIDL RXF0SIDL
extern volatile unsigned char           RXF0SIDL            __at(0xEE1);
#ifndef _LIB_BUILD
asm("RXF0SIDL equ 0EE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF0EID16              :1;
        unsigned RXF0EID17              :1;
        unsigned                        :1;
        unsigned RXF0EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF0SID0               :1;
        unsigned RXF0SID1               :1;
        unsigned RXF0SID2               :1;
    };
} RXF0SIDLbits_t;
extern volatile RXF0SIDLbits_t RXF0SIDLbits __at(0xEE1);
// bitfield macros
#define _RXF0SIDL_EID_POSN                                  0x0
#define _RXF0SIDL_EID_POSITION                              0x0
#define _RXF0SIDL_EID_SIZE                                  0x2
#define _RXF0SIDL_EID_LENGTH                                0x2
#define _RXF0SIDL_EID_MASK                                  0x3
#define _RXF0SIDL_EXIDEN_POSN                               0x3
#define _RXF0SIDL_EXIDEN_POSITION                           0x3
#define _RXF0SIDL_EXIDEN_SIZE                               0x1
#define _RXF0SIDL_EXIDEN_LENGTH                             0x1
#define _RXF0SIDL_EXIDEN_MASK                               0x8
#define _RXF0SIDL_SID_POSN                                  0x5
#define _RXF0SIDL_SID_POSITION                              0x5
#define _RXF0SIDL_SID_SIZE                                  0x3
#define _RXF0SIDL_SID_LENGTH                                0x3
#define _RXF0SIDL_SID_MASK                                  0xE0
#define _RXF0SIDL_EID16_POSN                                0x0
#define _RXF0SIDL_EID16_POSITION                            0x0
#define _RXF0SIDL_EID16_SIZE                                0x1
#define _RXF0SIDL_EID16_LENGTH                              0x1
#define _RXF0SIDL_EID16_MASK                                0x1
#define _RXF0SIDL_EID17_POSN                                0x1
#define _RXF0SIDL_EID17_POSITION                            0x1
#define _RXF0SIDL_EID17_SIZE                                0x1
#define _RXF0SIDL_EID17_LENGTH                              0x1
#define _RXF0SIDL_EID17_MASK                                0x2
#define _RXF0SIDL_SID0_POSN                                 0x5
#define _RXF0SIDL_SID0_POSITION                             0x5
#define _RXF0SIDL_SID0_SIZE                                 0x1
#define _RXF0SIDL_SID0_LENGTH                               0x1
#define _RXF0SIDL_SID0_MASK                                 0x20
#define _RXF0SIDL_SID1_POSN                                 0x6
#define _RXF0SIDL_SID1_POSITION                             0x6
#define _RXF0SIDL_SID1_SIZE                                 0x1
#define _RXF0SIDL_SID1_LENGTH                               0x1
#define _RXF0SIDL_SID1_MASK                                 0x40
#define _RXF0SIDL_SID2_POSN                                 0x7
#define _RXF0SIDL_SID2_POSITION                             0x7
#define _RXF0SIDL_SID2_SIZE                                 0x1
#define _RXF0SIDL_SID2_LENGTH                               0x1
#define _RXF0SIDL_SID2_MASK                                 0x80
#define _RXF0SIDL_RXF0EID16_POSN                            0x0
#define _RXF0SIDL_RXF0EID16_POSITION                        0x0
#define _RXF0SIDL_RXF0EID16_SIZE                            0x1
#define _RXF0SIDL_RXF0EID16_LENGTH                          0x1
#define _RXF0SIDL_RXF0EID16_MASK                            0x1
#define _RXF0SIDL_RXF0EID17_POSN                            0x1
#define _RXF0SIDL_RXF0EID17_POSITION                        0x1
#define _RXF0SIDL_RXF0EID17_SIZE                            0x1
#define _RXF0SIDL_RXF0EID17_LENGTH                          0x1
#define _RXF0SIDL_RXF0EID17_MASK                            0x2
#define _RXF0SIDL_RXF0EXIDEN_POSN                           0x3
#define _RXF0SIDL_RXF0EXIDEN_POSITION                       0x3
#define _RXF0SIDL_RXF0EXIDEN_SIZE                           0x1
#define _RXF0SIDL_RXF0EXIDEN_LENGTH                         0x1
#define _RXF0SIDL_RXF0EXIDEN_MASK                           0x8
#define _RXF0SIDL_RXF0SID0_POSN                             0x5
#define _RXF0SIDL_RXF0SID0_POSITION                         0x5
#define _RXF0SIDL_RXF0SID0_SIZE                             0x1
#define _RXF0SIDL_RXF0SID0_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID0_MASK                             0x20
#define _RXF0SIDL_RXF0SID1_POSN                             0x6
#define _RXF0SIDL_RXF0SID1_POSITION                         0x6
#define _RXF0SIDL_RXF0SID1_SIZE                             0x1
#define _RXF0SIDL_RXF0SID1_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID1_MASK                             0x40
#define _RXF0SIDL_RXF0SID2_POSN                             0x7
#define _RXF0SIDL_RXF0SID2_POSITION                         0x7
#define _RXF0SIDL_RXF0SID2_SIZE                             0x1
#define _RXF0SIDL_RXF0SID2_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID2_MASK                             0x80

// Register: RXF0EIDH
#define RXF0EIDH RXF0EIDH
extern volatile unsigned char           RXF0EIDH            __at(0xEE2);
#ifndef _LIB_BUILD
asm("RXF0EIDH equ 0EE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF0EID8               :1;
        unsigned RXF0EID9               :1;
        unsigned RXF0EID10              :1;
        unsigned RXF0EID11              :1;
        unsigned RXF0EID12              :1;
        unsigned RXF0EID13              :1;
        unsigned RXF0EID14              :1;
        unsigned RXF0EID15              :1;
    };
} RXF0EIDHbits_t;
extern volatile RXF0EIDHbits_t RXF0EIDHbits __at(0xEE2);
// bitfield macros
#define _RXF0EIDH_EID_POSN                                  0x0
#define _RXF0EIDH_EID_POSITION                              0x0
#define _RXF0EIDH_EID_SIZE                                  0x8
#define _RXF0EIDH_EID_LENGTH                                0x8
#define _RXF0EIDH_EID_MASK                                  0xFF
#define _RXF0EIDH_EID8_POSN                                 0x0
#define _RXF0EIDH_EID8_POSITION                             0x0
#define _RXF0EIDH_EID8_SIZE                                 0x1
#define _RXF0EIDH_EID8_LENGTH                               0x1
#define _RXF0EIDH_EID8_MASK                                 0x1
#define _RXF0EIDH_EID9_POSN                                 0x1
#define _RXF0EIDH_EID9_POSITION                             0x1
#define _RXF0EIDH_EID9_SIZE                                 0x1
#define _RXF0EIDH_EID9_LENGTH                               0x1
#define _RXF0EIDH_EID9_MASK                                 0x2
#define _RXF0EIDH_EID10_POSN                                0x2
#define _RXF0EIDH_EID10_POSITION                            0x2
#define _RXF0EIDH_EID10_SIZE                                0x1
#define _RXF0EIDH_EID10_LENGTH                              0x1
#define _RXF0EIDH_EID10_MASK                                0x4
#define _RXF0EIDH_EID11_POSN                                0x3
#define _RXF0EIDH_EID11_POSITION                            0x3
#define _RXF0EIDH_EID11_SIZE                                0x1
#define _RXF0EIDH_EID11_LENGTH                              0x1
#define _RXF0EIDH_EID11_MASK                                0x8
#define _RXF0EIDH_EID12_POSN                                0x4
#define _RXF0EIDH_EID12_POSITION                            0x4
#define _RXF0EIDH_EID12_SIZE                                0x1
#define _RXF0EIDH_EID12_LENGTH                              0x1
#define _RXF0EIDH_EID12_MASK                                0x10
#define _RXF0EIDH_EID13_POSN                                0x5
#define _RXF0EIDH_EID13_POSITION                            0x5
#define _RXF0EIDH_EID13_SIZE                                0x1
#define _RXF0EIDH_EID13_LENGTH                              0x1
#define _RXF0EIDH_EID13_MASK                                0x20
#define _RXF0EIDH_EID14_POSN                                0x6
#define _RXF0EIDH_EID14_POSITION                            0x6
#define _RXF0EIDH_EID14_SIZE                                0x1
#define _RXF0EIDH_EID14_LENGTH                              0x1
#define _RXF0EIDH_EID14_MASK                                0x40
#define _RXF0EIDH_EID15_POSN                                0x7
#define _RXF0EIDH_EID15_POSITION                            0x7
#define _RXF0EIDH_EID15_SIZE                                0x1
#define _RXF0EIDH_EID15_LENGTH                              0x1
#define _RXF0EIDH_EID15_MASK                                0x80
#define _RXF0EIDH_RXF0EID8_POSN                             0x0
#define _RXF0EIDH_RXF0EID8_POSITION                         0x0
#define _RXF0EIDH_RXF0EID8_SIZE                             0x1
#define _RXF0EIDH_RXF0EID8_LENGTH                           0x1
#define _RXF0EIDH_RXF0EID8_MASK                             0x1
#define _RXF0EIDH_RXF0EID9_POSN                             0x1
#define _RXF0EIDH_RXF0EID9_POSITION                         0x1
#define _RXF0EIDH_RXF0EID9_SIZE                             0x1
#define _RXF0EIDH_RXF0EID9_LENGTH                           0x1
#define _RXF0EIDH_RXF0EID9_MASK                             0x2
#define _RXF0EIDH_RXF0EID10_POSN                            0x2
#define _RXF0EIDH_RXF0EID10_POSITION                        0x2
#define _RXF0EIDH_RXF0EID10_SIZE                            0x1
#define _RXF0EIDH_RXF0EID10_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID10_MASK                            0x4
#define _RXF0EIDH_RXF0EID11_POSN                            0x3
#define _RXF0EIDH_RXF0EID11_POSITION                        0x3
#define _RXF0EIDH_RXF0EID11_SIZE                            0x1
#define _RXF0EIDH_RXF0EID11_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID11_MASK                            0x8
#define _RXF0EIDH_RXF0EID12_POSN                            0x4
#define _RXF0EIDH_RXF0EID12_POSITION                        0x4
#define _RXF0EIDH_RXF0EID12_SIZE                            0x1
#define _RXF0EIDH_RXF0EID12_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID12_MASK                            0x10
#define _RXF0EIDH_RXF0EID13_POSN                            0x5
#define _RXF0EIDH_RXF0EID13_POSITION                        0x5
#define _RXF0EIDH_RXF0EID13_SIZE                            0x1
#define _RXF0EIDH_RXF0EID13_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID13_MASK                            0x20
#define _RXF0EIDH_RXF0EID14_POSN                            0x6
#define _RXF0EIDH_RXF0EID14_POSITION                        0x6
#define _RXF0EIDH_RXF0EID14_SIZE                            0x1
#define _RXF0EIDH_RXF0EID14_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID14_MASK                            0x40
#define _RXF0EIDH_RXF0EID15_POSN                            0x7
#define _RXF0EIDH_RXF0EID15_POSITION                        0x7
#define _RXF0EIDH_RXF0EID15_SIZE                            0x1
#define _RXF0EIDH_RXF0EID15_LENGTH                          0x1
#define _RXF0EIDH_RXF0EID15_MASK                            0x80

