MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
// Register: TXB1SIDL
#define TXB1SIDL TXB1SIDL
extern volatile unsigned char           TXB1SIDL            __at(0xF12);
#ifndef _LIB_BUILD
asm("TXB1SIDL equ 0F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned TXB1EID16              :1;
        unsigned TXB1EID17              :1;
        unsigned                        :1;
        unsigned TXB1EXIDE              :1;
        unsigned                        :1;
        unsigned TXB1SID0               :1;
        unsigned TXB1SID1               :1;
        unsigned TXB1SID2               :1;
    };
} TXB1SIDLbits_t;
extern volatile TXB1SIDLbits_t TXB1SIDLbits __at(0xF12);
// bitfield macros
#define _TXB1SIDL_EID_POSN                                  0x0
#define _TXB1SIDL_EID_POSITION                              0x0
#define _TXB1SIDL_EID_SIZE                                  0x2
#define _TXB1SIDL_EID_LENGTH                                0x2
#define _TXB1SIDL_EID_MASK                                  0x3
#define _TXB1SIDL_EXIDE_POSN                                0x3
#define _TXB1SIDL_EXIDE_POSITION                            0x3
#define _TXB1SIDL_EXIDE_SIZE                                0x1
#define _TXB1SIDL_EXIDE_LENGTH                              0x1
#define _TXB1SIDL_EXIDE_MASK                                0x8
#define _TXB1SIDL_SRR_POSN                                  0x4
#define _TXB1SIDL_SRR_POSITION                              0x4
#define _TXB1SIDL_SRR_SIZE                                  0x1
#define _TXB1SIDL_SRR_LENGTH                                0x1
#define _TXB1SIDL_SRR_MASK                                  0x10
#define _TXB1SIDL_SID_POSN                                  0x5
#define _TXB1SIDL_SID_POSITION                              0x5
#define _TXB1SIDL_SID_SIZE                                  0x3
#define _TXB1SIDL_SID_LENGTH                                0x3
#define _TXB1SIDL_SID_MASK                                  0xE0
#define _TXB1SIDL_EID16_POSN                                0x0
#define _TXB1SIDL_EID16_POSITION                            0x0
#define _TXB1SIDL_EID16_SIZE                                0x1
#define _TXB1SIDL_EID16_LENGTH                              0x1
#define _TXB1SIDL_EID16_MASK                                0x1
#define _TXB1SIDL_EID17_POSN                                0x1
#define _TXB1SIDL_EID17_POSITION                            0x1
#define _TXB1SIDL_EID17_SIZE                                0x1
#define _TXB1SIDL_EID17_LENGTH                              0x1
#define _TXB1SIDL_EID17_MASK                                0x2
#define _TXB1SIDL_SID0_POSN                                 0x5
#define _TXB1SIDL_SID0_POSITION                             0x5
#define _TXB1SIDL_SID0_SIZE                                 0x1
#define _TXB1SIDL_SID0_LENGTH                               0x1
#define _TXB1SIDL_SID0_MASK                                 0x20
#define _TXB1SIDL_SID1_POSN                                 0x6
#define _TXB1SIDL_SID1_POSITION                             0x6
#define _TXB1SIDL_SID1_SIZE                                 0x1
#define _TXB1SIDL_SID1_LENGTH                               0x1
#define _TXB1SIDL_SID1_MASK                                 0x40
#define _TXB1SIDL_SID2_POSN                                 0x7
#define _TXB1SIDL_SID2_POSITION                             0x7
#define _TXB1SIDL_SID2_SIZE                                 0x1
#define _TXB1SIDL_SID2_LENGTH                               0x1
#define _TXB1SIDL_SID2_MASK                                 0x80
#define _TXB1SIDL_TXB1EID16_POSN                            0x0
#define _TXB1SIDL_TXB1EID16_POSITION                        0x0
#define _TXB1SIDL_TXB1EID16_SIZE                            0x1
#define _TXB1SIDL_TXB1EID16_LENGTH                          0x1
#define _TXB1SIDL_TXB1EID16_MASK                            0x1
#define _TXB1SIDL_TXB1EID17_POSN                            0x1
#define _TXB1SIDL_TXB1EID17_POSITION                        0x1
#define _TXB1SIDL_TXB1EID17_SIZE                            0x1
#define _TXB1SIDL_TXB1EID17_LENGTH                          0x1
#define _TXB1SIDL_TXB1EID17_MASK                            0x2
#define _TXB1SIDL_TXB1EXIDE_POSN                            0x3
#define _TXB1SIDL_TXB1EXIDE_POSITION                        0x3
#define _TXB1SIDL_TXB1EXIDE_SIZE                            0x1
#define _TXB1SIDL_TXB1EXIDE_LENGTH                          0x1
#define _TXB1SIDL_TXB1EXIDE_MASK                            0x8
#define _TXB1SIDL_TXB1SID0_POSN                             0x5
#define _TXB1SIDL_TXB1SID0_POSITION                         0x5
#define _TXB1SIDL_TXB1SID0_SIZE                             0x1
#define _TXB1SIDL_TXB1SID0_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID0_MASK                             0x20
#define _TXB1SIDL_TXB1SID1_POSN                             0x6
#define _TXB1SIDL_TXB1SID1_POSITION                         0x6
#define _TXB1SIDL_TXB1SID1_SIZE                             0x1
#define _TXB1SIDL_TXB1SID1_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID1_MASK                             0x40
#define _TXB1SIDL_TXB1SID2_POSN                             0x7
#define _TXB1SIDL_TXB1SID2_POSITION                         0x7
#define _TXB1SIDL_TXB1SID2_SIZE                             0x1
#define _TXB1SIDL_TXB1SID2_LENGTH                           0x1
#define _TXB1SIDL_TXB1SID2_MASK                             0x80

// Register: TXB1EIDH
#define TXB1EIDH TXB1EIDH
extern volatile unsigned char           TXB1EIDH            __at(0xF13);
#ifndef _LIB_BUILD
asm("TXB1EIDH equ 0F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned TXB1EID8               :1;
        unsigned TXB1EID9               :1;
        unsigned TXB1EID10              :1;
        unsigned TXB1EID11              :1;
        unsigned TXB1EID12              :1;
        unsigned TXB1EID13              :1;
        unsigned TXB1EID14              :1;
        unsigned TXB1EID15              :1;
    };
} TXB1EIDHbits_t;
extern volatile TXB1EIDHbits_t TXB1EIDHbits __at(0xF13);
// bitfield macros
#define _TXB1EIDH_EID_POSN                                  0x0
#define _TXB1EIDH_EID_POSITION                              0x0
#define _TXB1EIDH_EID_SIZE                                  0x8
#define _TXB1EIDH_EID_LENGTH                                0x8
#define _TXB1EIDH_EID_MASK                                  0xFF
#define _TXB1EIDH_EID8_POSN                                 0x0
#define _TXB1EIDH_EID8_POSITION                             0x0
#define _TXB1EIDH_EID8_SIZE                                 0x1
#define _TXB1EIDH_EID8_LENGTH                               0x1
#define _TXB1EIDH_EID8_MASK                                 0x1
#define _TXB1EIDH_EID9_POSN                                 0x1
#define _TXB1EIDH_EID9_POSITION                             0x1
#define _TXB1EIDH_EID9_SIZE                                 0x1
#define _TXB1EIDH_EID9_LENGTH                               0x1
#define _TXB1EIDH_EID9_MASK                                 0x2
#define _TXB1EIDH_EID10_POSN                                0x2
#define _TXB1EIDH_EID10_POSITION                            0x2
#define _TXB1EIDH_EID10_SIZE                                0x1
#define _TXB1EIDH_EID10_LENGTH                              0x1
#define _TXB1EIDH_EID10_MASK                                0x4
#define _TXB1EIDH_EID11_POSN                                0x3
#define _TXB1EIDH_EID11_POSITION                            0x3
#define _TXB1EIDH_EID11_SIZE                                0x1
#define _TXB1EIDH_EID11_LENGTH                              0x1
#define _TXB1EIDH_EID11_MASK                                0x8
#define _TXB1EIDH_EID12_POSN                                0x4
#define _TXB1EIDH_EID12_POSITION                            0x4
#define _TXB1EIDH_EID12_SIZE                                0x1
#define _TXB1EIDH_EID12_LENGTH                              0x1
#define _TXB1EIDH_EID12_MASK                                0x10
#define _TXB1EIDH_EID13_POSN                                0x5
#define _TXB1EIDH_EID13_POSITION                            0x5
#define _TXB1EIDH_EID13_SIZE                                0x1
#define _TXB1EIDH_EID13_LENGTH                              0x1
#define _TXB1EIDH_EID13_MASK                                0x20
#define _TXB1EIDH_EID14_POSN                                0x6
#define _TXB1EIDH_EID14_POSITION                            0x6
#define _TXB1EIDH_EID14_SIZE                                0x1
#define _TXB1EIDH_EID14_LENGTH                              0x1
#define _TXB1EIDH_EID14_MASK                                0x40
#define _TXB1EIDH_EID15_POSN                                0x7
#define _TXB1EIDH_EID15_POSITION                            0x7
#define _TXB1EIDH_EID15_SIZE                                0x1
#define _TXB1EIDH_EID15_LENGTH                              0x1
#define _TXB1EIDH_EID15_MASK                                0x80
#define _TXB1EIDH_TXB1EID8_POSN                             0x0
#define _TXB1EIDH_TXB1EID8_POSITION                         0x0
#define _TXB1EIDH_TXB1EID8_SIZE                             0x1
#define _TXB1EIDH_TXB1EID8_LENGTH                           0x1
#define _TXB1EIDH_TXB1EID8_MASK                             0x1
#define _TXB1EIDH_TXB1EID9_POSN                             0x1
#define _TXB1EIDH_TXB1EID9_POSITION                         0x1
#define _TXB1EIDH_TXB1EID9_SIZE                             0x1
#define _TXB1EIDH_TXB1EID9_LENGTH                           0x1
#define _TXB1EIDH_TXB1EID9_MASK                             0x2
#define _TXB1EIDH_TXB1EID10_POSN                            0x2
#define _TXB1EIDH_TXB1EID10_POSITION                        0x2
#define _TXB1EIDH_TXB1EID10_SIZE                            0x1
#define _TXB1EIDH_TXB1EID10_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID10_MASK                            0x4
#define _TXB1EIDH_TXB1EID11_POSN                            0x3
#define _TXB1EIDH_TXB1EID11_POSITION                        0x3
#define _TXB1EIDH_TXB1EID11_SIZE                            0x1
#define _TXB1EIDH_TXB1EID11_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID11_MASK                            0x8
#define _TXB1EIDH_TXB1EID12_POSN                            0x4
#define _TXB1EIDH_TXB1EID12_POSITION                        0x4
#define _TXB1EIDH_TXB1EID12_SIZE                            0x1
#define _TXB1EIDH_TXB1EID12_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID12_MASK                            0x10
#define _TXB1EIDH_TXB1EID13_POSN                            0x5
#define _TXB1EIDH_TXB1EID13_POSITION                        0x5
#define _TXB1EIDH_TXB1EID13_SIZE                            0x1
#define _TXB1EIDH_TXB1EID13_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID13_MASK                            0x20
#define _TXB1EIDH_TXB1EID14_POSN                            0x6
#define _TXB1EIDH_TXB1EID14_POSITION                        0x6
#define _TXB1EIDH_TXB1EID14_SIZE                            0x1
#define _TXB1EIDH_TXB1EID14_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID14_MASK                            0x40
#define _TXB1EIDH_TXB1EID15_POSN                            0x7
#define _TXB1EIDH_TXB1EID15_POSITION                        0x7
#define _TXB1EIDH_TXB1EID15_SIZE                            0x1
#define _TXB1EIDH_TXB1EID15_LENGTH                          0x1
#define _TXB1EIDH_TXB1EID15_MASK                            0x80

// Register: TXB1EIDL
#define TXB1EIDL TXB1EIDL
extern volatile unsigned char           TXB1EIDL            __at(0xF14);
#ifndef _LIB_BUILD
asm("TXB1EIDL equ 0F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned TXB1EID0               :1;
        unsigned TXB1EID1               :1;
        unsigned TXB1EID2               :1;
        unsigned TXB1EID3               :1;
        unsigned TXB1EID4               :1;
        unsigned TXB1EID5               :1;
        unsigned TXB1EID6               :1;
        unsigned TXB1EID7               :1;
    };
} TXB1EIDLbits_t;
