MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile TXB1EIDLbits_t TXB1EIDLbits __at(0xF14);
// bitfield macros
#define _TXB1EIDL_EID_POSN                                  0x0
#define _TXB1EIDL_EID_POSITION                              0x0
#define _TXB1EIDL_EID_SIZE                                  0x8
#define _TXB1EIDL_EID_LENGTH                                0x8
#define _TXB1EIDL_EID_MASK                                  0xFF
#define _TXB1EIDL_EID0_POSN                                 0x0
#define _TXB1EIDL_EID0_POSITION                             0x0
#define _TXB1EIDL_EID0_SIZE                                 0x1
#define _TXB1EIDL_EID0_LENGTH                               0x1
#define _TXB1EIDL_EID0_MASK                                 0x1
#define _TXB1EIDL_EID1_POSN                                 0x1
#define _TXB1EIDL_EID1_POSITION                             0x1
#define _TXB1EIDL_EID1_SIZE                                 0x1
#define _TXB1EIDL_EID1_LENGTH                               0x1
#define _TXB1EIDL_EID1_MASK                                 0x2
#define _TXB1EIDL_EID2_POSN                                 0x2
#define _TXB1EIDL_EID2_POSITION                             0x2
#define _TXB1EIDL_EID2_SIZE                                 0x1
#define _TXB1EIDL_EID2_LENGTH                               0x1
#define _TXB1EIDL_EID2_MASK                                 0x4
#define _TXB1EIDL_EID3_POSN                                 0x3
#define _TXB1EIDL_EID3_POSITION                             0x3
#define _TXB1EIDL_EID3_SIZE                                 0x1
#define _TXB1EIDL_EID3_LENGTH                               0x1
#define _TXB1EIDL_EID3_MASK                                 0x8
#define _TXB1EIDL_EID4_POSN                                 0x4
#define _TXB1EIDL_EID4_POSITION                             0x4
#define _TXB1EIDL_EID4_SIZE                                 0x1
#define _TXB1EIDL_EID4_LENGTH                               0x1
#define _TXB1EIDL_EID4_MASK                                 0x10
#define _TXB1EIDL_EID5_POSN                                 0x5
#define _TXB1EIDL_EID5_POSITION                             0x5
#define _TXB1EIDL_EID5_SIZE                                 0x1
#define _TXB1EIDL_EID5_LENGTH                               0x1
#define _TXB1EIDL_EID5_MASK                                 0x20
#define _TXB1EIDL_EID6_POSN                                 0x6
#define _TXB1EIDL_EID6_POSITION                             0x6
#define _TXB1EIDL_EID6_SIZE                                 0x1
#define _TXB1EIDL_EID6_LENGTH                               0x1
#define _TXB1EIDL_EID6_MASK                                 0x40
#define _TXB1EIDL_EID7_POSN                                 0x7
#define _TXB1EIDL_EID7_POSITION                             0x7
#define _TXB1EIDL_EID7_SIZE                                 0x1
#define _TXB1EIDL_EID7_LENGTH                               0x1
#define _TXB1EIDL_EID7_MASK                                 0x80
#define _TXB1EIDL_TXB1EID0_POSN                             0x0
#define _TXB1EIDL_TXB1EID0_POSITION                         0x0
#define _TXB1EIDL_TXB1EID0_SIZE                             0x1
#define _TXB1EIDL_TXB1EID0_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID0_MASK                             0x1
#define _TXB1EIDL_TXB1EID1_POSN                             0x1
#define _TXB1EIDL_TXB1EID1_POSITION                         0x1
#define _TXB1EIDL_TXB1EID1_SIZE                             0x1
#define _TXB1EIDL_TXB1EID1_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID1_MASK                             0x2
#define _TXB1EIDL_TXB1EID2_POSN                             0x2
#define _TXB1EIDL_TXB1EID2_POSITION                         0x2
#define _TXB1EIDL_TXB1EID2_SIZE                             0x1
#define _TXB1EIDL_TXB1EID2_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID2_MASK                             0x4
#define _TXB1EIDL_TXB1EID3_POSN                             0x3
#define _TXB1EIDL_TXB1EID3_POSITION                         0x3
#define _TXB1EIDL_TXB1EID3_SIZE                             0x1
#define _TXB1EIDL_TXB1EID3_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID3_MASK                             0x8
#define _TXB1EIDL_TXB1EID4_POSN                             0x4
#define _TXB1EIDL_TXB1EID4_POSITION                         0x4
#define _TXB1EIDL_TXB1EID4_SIZE                             0x1
#define _TXB1EIDL_TXB1EID4_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID4_MASK                             0x10
#define _TXB1EIDL_TXB1EID5_POSN                             0x5
#define _TXB1EIDL_TXB1EID5_POSITION                         0x5
#define _TXB1EIDL_TXB1EID5_SIZE                             0x1
#define _TXB1EIDL_TXB1EID5_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID5_MASK                             0x20
#define _TXB1EIDL_TXB1EID6_POSN                             0x6
#define _TXB1EIDL_TXB1EID6_POSITION                         0x6
#define _TXB1EIDL_TXB1EID6_SIZE                             0x1
#define _TXB1EIDL_TXB1EID6_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID6_MASK                             0x40
#define _TXB1EIDL_TXB1EID7_POSN                             0x7
#define _TXB1EIDL_TXB1EID7_POSITION                         0x7
#define _TXB1EIDL_TXB1EID7_SIZE                             0x1
#define _TXB1EIDL_TXB1EID7_LENGTH                           0x1
#define _TXB1EIDL_TXB1EID7_MASK                             0x80

// Register: TXB1DLC
#define TXB1DLC TXB1DLC
extern volatile unsigned char           TXB1DLC             __at(0xF15);
#ifndef _LIB_BUILD
asm("TXB1DLC equ 0F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC                    :4;
        unsigned                        :2;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
    };
    struct {
        unsigned TXB1DLC0               :1;
        unsigned TXB1DLC1               :1;
        unsigned TXB1DLC2               :1;
        unsigned TXB1DLC3               :1;
        unsigned                        :2;
        unsigned TXB1RTR                :1;
    };
} TXB1DLCbits_t;
