MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile TXB0D4bits_t TXB0D4bits __at(0xF2A);
// bitfield macros
#define _TXB0D4_TXB0D4_POSN                                 0x0
#define _TXB0D4_TXB0D4_POSITION                             0x0
#define _TXB0D4_TXB0D4_SIZE                                 0x8
#define _TXB0D4_TXB0D4_LENGTH                               0x8
#define _TXB0D4_TXB0D4_MASK                                 0xFF
#define _TXB0D4_TXB0D40_POSN                                0x0
#define _TXB0D4_TXB0D40_POSITION                            0x0
#define _TXB0D4_TXB0D40_SIZE                                0x1
#define _TXB0D4_TXB0D40_LENGTH                              0x1
#define _TXB0D4_TXB0D40_MASK                                0x1
#define _TXB0D4_TXB0D41_POSN                                0x1
#define _TXB0D4_TXB0D41_POSITION                            0x1
#define _TXB0D4_TXB0D41_SIZE                                0x1
#define _TXB0D4_TXB0D41_LENGTH                              0x1
#define _TXB0D4_TXB0D41_MASK                                0x2
#define _TXB0D4_TXB0D42_POSN                                0x2
#define _TXB0D4_TXB0D42_POSITION                            0x2
#define _TXB0D4_TXB0D42_SIZE                                0x1
#define _TXB0D4_TXB0D42_LENGTH                              0x1
#define _TXB0D4_TXB0D42_MASK                                0x4
#define _TXB0D4_TXB0D43_POSN                                0x3
#define _TXB0D4_TXB0D43_POSITION                            0x3
#define _TXB0D4_TXB0D43_SIZE                                0x1
#define _TXB0D4_TXB0D43_LENGTH                              0x1
#define _TXB0D4_TXB0D43_MASK                                0x8
#define _TXB0D4_TXB0D44_POSN                                0x4
#define _TXB0D4_TXB0D44_POSITION                            0x4
#define _TXB0D4_TXB0D44_SIZE                                0x1
#define _TXB0D4_TXB0D44_LENGTH                              0x1
#define _TXB0D4_TXB0D44_MASK                                0x10
#define _TXB0D4_TXB0D45_POSN                                0x5
#define _TXB0D4_TXB0D45_POSITION                            0x5
#define _TXB0D4_TXB0D45_SIZE                                0x1
#define _TXB0D4_TXB0D45_LENGTH                              0x1
#define _TXB0D4_TXB0D45_MASK                                0x20
#define _TXB0D4_TXB0D46_POSN                                0x6
#define _TXB0D4_TXB0D46_POSITION                            0x6
#define _TXB0D4_TXB0D46_SIZE                                0x1
#define _TXB0D4_TXB0D46_LENGTH                              0x1
#define _TXB0D4_TXB0D46_MASK                                0x40
#define _TXB0D4_TXB0D47_POSN                                0x7
#define _TXB0D4_TXB0D47_POSITION                            0x7
#define _TXB0D4_TXB0D47_SIZE                                0x1
#define _TXB0D4_TXB0D47_LENGTH                              0x1
#define _TXB0D4_TXB0D47_MASK                                0x80

// Register: TXB0D5
#define TXB0D5 TXB0D5
extern volatile unsigned char           TXB0D5              __at(0xF2B);
#ifndef _LIB_BUILD
asm("TXB0D5 equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D5                 :8;
    };
    struct {
        unsigned TXB0D50                :1;
        unsigned TXB0D51                :1;
        unsigned TXB0D52                :1;
        unsigned TXB0D53                :1;
        unsigned TXB0D54                :1;
        unsigned TXB0D55                :1;
        unsigned TXB0D56                :1;
        unsigned TXB0D57                :1;
    };
} TXB0D5bits_t;
extern volatile TXB0D5bits_t TXB0D5bits __at(0xF2B);
// bitfield macros
#define _TXB0D5_TXB0D5_POSN                                 0x0
#define _TXB0D5_TXB0D5_POSITION                             0x0
#define _TXB0D5_TXB0D5_SIZE                                 0x8
#define _TXB0D5_TXB0D5_LENGTH                               0x8
#define _TXB0D5_TXB0D5_MASK                                 0xFF
#define _TXB0D5_TXB0D50_POSN                                0x0
#define _TXB0D5_TXB0D50_POSITION                            0x0
#define _TXB0D5_TXB0D50_SIZE                                0x1
#define _TXB0D5_TXB0D50_LENGTH                              0x1
#define _TXB0D5_TXB0D50_MASK                                0x1
#define _TXB0D5_TXB0D51_POSN                                0x1
#define _TXB0D5_TXB0D51_POSITION                            0x1
#define _TXB0D5_TXB0D51_SIZE                                0x1
#define _TXB0D5_TXB0D51_LENGTH                              0x1
#define _TXB0D5_TXB0D51_MASK                                0x2
#define _TXB0D5_TXB0D52_POSN                                0x2
#define _TXB0D5_TXB0D52_POSITION                            0x2
#define _TXB0D5_TXB0D52_SIZE                                0x1
#define _TXB0D5_TXB0D52_LENGTH                              0x1
#define _TXB0D5_TXB0D52_MASK                                0x4
#define _TXB0D5_TXB0D53_POSN                                0x3
#define _TXB0D5_TXB0D53_POSITION                            0x3
#define _TXB0D5_TXB0D53_SIZE                                0x1
#define _TXB0D5_TXB0D53_LENGTH                              0x1
#define _TXB0D5_TXB0D53_MASK                                0x8
#define _TXB0D5_TXB0D54_POSN                                0x4
#define _TXB0D5_TXB0D54_POSITION                            0x4
#define _TXB0D5_TXB0D54_SIZE                                0x1
#define _TXB0D5_TXB0D54_LENGTH                              0x1
#define _TXB0D5_TXB0D54_MASK                                0x10
#define _TXB0D5_TXB0D55_POSN                                0x5
#define _TXB0D5_TXB0D55_POSITION                            0x5
#define _TXB0D5_TXB0D55_SIZE                                0x1
#define _TXB0D5_TXB0D55_LENGTH                              0x1
#define _TXB0D5_TXB0D55_MASK                                0x20
#define _TXB0D5_TXB0D56_POSN                                0x6
#define _TXB0D5_TXB0D56_POSITION                            0x6
#define _TXB0D5_TXB0D56_SIZE                                0x1
#define _TXB0D5_TXB0D56_LENGTH                              0x1
#define _TXB0D5_TXB0D56_MASK                                0x40
#define _TXB0D5_TXB0D57_POSN                                0x7
#define _TXB0D5_TXB0D57_POSITION                            0x7
#define _TXB0D5_TXB0D57_SIZE                                0x1
#define _TXB0D5_TXB0D57_LENGTH                              0x1
#define _TXB0D5_TXB0D57_MASK                                0x80

// Register: TXB0D6
#define TXB0D6 TXB0D6
extern volatile unsigned char           TXB0D6              __at(0xF2C);
#ifndef _LIB_BUILD
asm("TXB0D6 equ 0F2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D6                 :8;
    };
    struct {
        unsigned TXB0D60                :1;
        unsigned TXB0D61                :1;
        unsigned TXB0D62                :1;
        unsigned TXB0D63                :1;
        unsigned TXB0D64                :1;
        unsigned TXB0D65                :1;
        unsigned TXB0D66                :1;
        unsigned TXB0D67                :1;
    };
} TXB0D6bits_t;
extern volatile TXB0D6bits_t TXB0D6bits __at(0xF2C);
// bitfield macros
#define _TXB0D6_TXB0D6_POSN                                 0x0
#define _TXB0D6_TXB0D6_POSITION                             0x0
#define _TXB0D6_TXB0D6_SIZE                                 0x8
#define _TXB0D6_TXB0D6_LENGTH                               0x8
#define _TXB0D6_TXB0D6_MASK                                 0xFF
#define _TXB0D6_TXB0D60_POSN                                0x0
#define _TXB0D6_TXB0D60_POSITION                            0x0
#define _TXB0D6_TXB0D60_SIZE                                0x1
#define _TXB0D6_TXB0D60_LENGTH                              0x1
#define _TXB0D6_TXB0D60_MASK                                0x1
#define _TXB0D6_TXB0D61_POSN                                0x1
#define _TXB0D6_TXB0D61_POSITION                            0x1
#define _TXB0D6_TXB0D61_SIZE                                0x1
#define _TXB0D6_TXB0D61_LENGTH                              0x1
#define _TXB0D6_TXB0D61_MASK                                0x2
#define _TXB0D6_TXB0D62_POSN                                0x2
#define _TXB0D6_TXB0D62_POSITION                            0x2
#define _TXB0D6_TXB0D62_SIZE                                0x1
#define _TXB0D6_TXB0D62_LENGTH                              0x1
#define _TXB0D6_TXB0D62_MASK                                0x4
#define _TXB0D6_TXB0D63_POSN                                0x3
#define _TXB0D6_TXB0D63_POSITION                            0x3
#define _TXB0D6_TXB0D63_SIZE                                0x1
#define _TXB0D6_TXB0D63_LENGTH                              0x1
#define _TXB0D6_TXB0D63_MASK                                0x8
#define _TXB0D6_TXB0D64_POSN                                0x4
#define _TXB0D6_TXB0D64_POSITION                            0x4
#define _TXB0D6_TXB0D64_SIZE                                0x1
#define _TXB0D6_TXB0D64_LENGTH                              0x1
#define _TXB0D6_TXB0D64_MASK                                0x10
#define _TXB0D6_TXB0D65_POSN                                0x5
#define _TXB0D6_TXB0D65_POSITION                            0x5
#define _TXB0D6_TXB0D65_SIZE                                0x1
#define _TXB0D6_TXB0D65_LENGTH                              0x1
#define _TXB0D6_TXB0D65_MASK                                0x20
#define _TXB0D6_TXB0D66_POSN                                0x6
#define _TXB0D6_TXB0D66_POSITION                            0x6
#define _TXB0D6_TXB0D66_SIZE                                0x1
#define _TXB0D6_TXB0D66_LENGTH                              0x1
#define _TXB0D6_TXB0D66_MASK                                0x40
#define _TXB0D6_TXB0D67_POSN                                0x7
#define _TXB0D6_TXB0D67_POSITION                            0x7
#define _TXB0D6_TXB0D67_SIZE                                0x1
#define _TXB0D6_TXB0D67_LENGTH                              0x1
#define _TXB0D6_TXB0D67_MASK                                0x80

// Register: TXB0D7
#define TXB0D7 TXB0D7
extern volatile unsigned char           TXB0D7              __at(0xF2D);
#ifndef _LIB_BUILD
asm("TXB0D7 equ 0F2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D7                 :8;
    };
    struct {
        unsigned TXB0D70                :1;
        unsigned TXB0D71                :1;
        unsigned TXB0D72                :1;
        unsigned TXB0D73                :1;
        unsigned TXB0D74                :1;
        unsigned TXB0D75                :1;
        unsigned TXB0D76                :1;
        unsigned TXB0D77                :1;
    };
} TXB0D7bits_t;
extern volatile TXB0D7bits_t TXB0D7bits __at(0xF2D);
// bitfield macros
#define _TXB0D7_TXB0D7_POSN                                 0x0
#define _TXB0D7_TXB0D7_POSITION                             0x0
#define _TXB0D7_TXB0D7_SIZE                                 0x8
#define _TXB0D7_TXB0D7_LENGTH                               0x8
#define _TXB0D7_TXB0D7_MASK                                 0xFF
#define _TXB0D7_TXB0D70_POSN                                0x0
#define _TXB0D7_TXB0D70_POSITION                            0x0
#define _TXB0D7_TXB0D70_SIZE                                0x1
#define _TXB0D7_TXB0D70_LENGTH                              0x1
#define _TXB0D7_TXB0D70_MASK                                0x1
#define _TXB0D7_TXB0D71_POSN                                0x1
#define _TXB0D7_TXB0D71_POSITION                            0x1
#define _TXB0D7_TXB0D71_SIZE                                0x1
#define _TXB0D7_TXB0D71_LENGTH                              0x1
#define _TXB0D7_TXB0D71_MASK                                0x2
#define _TXB0D7_TXB0D72_POSN                                0x2
#define _TXB0D7_TXB0D72_POSITION                            0x2
#define _TXB0D7_TXB0D72_SIZE                                0x1
#define _TXB0D7_TXB0D72_LENGTH                              0x1
#define _TXB0D7_TXB0D72_MASK                                0x4
#define _TXB0D7_TXB0D73_POSN                                0x3
#define _TXB0D7_TXB0D73_POSITION                            0x3
#define _TXB0D7_TXB0D73_SIZE                                0x1
#define _TXB0D7_TXB0D73_LENGTH                              0x1
#define _TXB0D7_TXB0D73_MASK                                0x8
#define _TXB0D7_TXB0D74_POSN                                0x4
#define _TXB0D7_TXB0D74_POSITION                            0x4
#define _TXB0D7_TXB0D74_SIZE                                0x1
#define _TXB0D7_TXB0D74_LENGTH                              0x1
#define _TXB0D7_TXB0D74_MASK                                0x10
#define _TXB0D7_TXB0D75_POSN                                0x5
#define _TXB0D7_TXB0D75_POSITION                            0x5
#define _TXB0D7_TXB0D75_SIZE                                0x1
#define _TXB0D7_TXB0D75_LENGTH                              0x1
#define _TXB0D7_TXB0D75_MASK                                0x20
#define _TXB0D7_TXB0D76_POSN                                0x6
#define _TXB0D7_TXB0D76_POSITION                            0x6
#define _TXB0D7_TXB0D76_SIZE                                0x1
#define _TXB0D7_TXB0D76_LENGTH                              0x1
#define _TXB0D7_TXB0D76_MASK                                0x40
#define _TXB0D7_TXB0D77_POSN                                0x7
#define _TXB0D7_TXB0D77_POSITION                            0x7
#define _TXB0D7_TXB0D77_SIZE                                0x1
#define _TXB0D7_TXB0D77_LENGTH                              0x1
#define _TXB0D7_TXB0D77_MASK                                0x80

