MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile __bit                   LC5                 __at(0x7C5D);	// @ (0xF8B * 8 + 5)
#define                                 LC5_bit             _BIT_ACCESS(LATC,5)
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x7C5E);	// @ (0xF8B * 8 + 6)
#define                                 LC6_bit             _BIT_ACCESS(LATC,6)
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x7C5F);	// @ (0xF8B * 8 + 7)
#define                                 LC7_bit             _BIT_ACCESS(LATC,7)
// LATD<LD0>
extern volatile __bit                   LD0                 __at(0x7C60);	// @ (0xF8C * 8 + 0)
#define                                 LD0_bit             _BIT_ACCESS(LATD,0)
// LATD<LD1>
extern volatile __bit                   LD1                 __at(0x7C61);	// @ (0xF8C * 8 + 1)
#define                                 LD1_bit             _BIT_ACCESS(LATD,1)
// LATD<LD2>
extern volatile __bit                   LD2                 __at(0x7C62);	// @ (0xF8C * 8 + 2)
#define                                 LD2_bit             _BIT_ACCESS(LATD,2)
// LATD<LD3>
extern volatile __bit                   LD3                 __at(0x7C63);	// @ (0xF8C * 8 + 3)
#define                                 LD3_bit             _BIT_ACCESS(LATD,3)
// LATD<LD4>
extern volatile __bit                   LD4                 __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LD4_bit             _BIT_ACCESS(LATD,4)
// LATD<LD5>
extern volatile __bit                   LD5                 __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LD5_bit             _BIT_ACCESS(LATD,5)
// LATD<LD6>
extern volatile __bit                   LD6                 __at(0x7C66);	// @ (0xF8C * 8 + 6)
#define                                 LD6_bit             _BIT_ACCESS(LATD,6)
// LATD<LD7>
extern volatile __bit                   LD7                 __at(0x7C67);	// @ (0xF8C * 8 + 7)
#define                                 LD7_bit             _BIT_ACCESS(LATD,7)
// LATE<LE0>
extern volatile __bit                   LE0                 __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 LE0_bit             _BIT_ACCESS(LATE,0)
// LATE<LE1>
extern volatile __bit                   LE1                 __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 LE1_bit             _BIT_ACCESS(LATE,1)
// LATE<LE2>
extern volatile __bit                   LE2                 __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 LE2_bit             _BIT_ACCESS(LATE,2)
// PIE2<LVDIE>
extern volatile __bit                   LVDIE               __at(0x7D02);	// @ (0xFA0 * 8 + 2)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE2,2)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 LVDIN_bit           _BIT_ACCESS(PORTA,5)
// IPR2<LVDIP>
extern volatile __bit                   LVDIP               __at(0x7D12);	// @ (0xFA2 * 8 + 2)
#define                                 LVDIP_bit           _BIT_ACCESS(IPR2,2)
// OSCCON2<LVDL0>
extern volatile __bit                   LVDL0               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 LVDL0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<LVDL1>
extern volatile __bit                   LVDL1               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 LVDL1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<LVDL2>
extern volatile __bit                   LVDL2               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 LVDL2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<LVDL3>
extern volatile __bit                   LVDL3               __at(0x7E93);	// @ (0xFD2 * 8 + 3)
#define                                 LVDL3_bit           _BIT_ACCESS(OSCCON2,3)
// ECANCON<MDSEL0>
extern volatile __bit                   MDSEL0              __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 MDSEL0_bit          _BIT_ACCESS(ECANCON,6)
// ECANCON<MDSEL1>
extern volatile __bit                   MDSEL1              __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 MDSEL1_bit          _BIT_ACCESS(ECANCON,7)
// OSCCON2<MFIOFS>
extern volatile __bit                   MFIOFS              __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 MFIOFS_bit          _BIT_ACCESS(OSCCON2,1)
// OSCCON2<MFIOSEL>
extern volatile __bit                   MFIOSEL             __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 MFIOSEL_bit         _BIT_ACCESS(OSCCON2,0)
// SSPADD<MSK0>
extern volatile __bit                   MSK0                __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSPADD,0)
// SSPADD<MSK1>
extern volatile __bit                   MSK1                __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSPADD,1)
// SSPADD<MSK2>
extern volatile __bit                   MSK2                __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSPADD,2)
// SSPADD<MSK3>
extern volatile __bit                   MSK3                __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSPADD,3)
// SSPADD<MSK4>
extern volatile __bit                   MSK4                __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSPADD,4)
// SSPADD<MSK5>
extern volatile __bit                   MSK5                __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSPADD,5)
// SSPADD<MSK6>
extern volatile __bit                   MSK6                __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSPADD,6)
// SSPADD<MSK7>
extern volatile __bit                   MSK7                __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSPADD,7)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// SSPSTAT<NOT_A>
extern volatile __bit                   NOT_A               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_A_bit           _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(SSPSTAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// RCON<NOT_CM>
extern volatile __bit                   NOT_CM              __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 NOT_CM_bit          _BIT_ACCESS(RCON,5)
// ADCON0<NOT_DONE>
extern volatile __bit                   NOT_DONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 NOT_DONE_bit        _BIT_ACCESS(ADCON0,1)
// COMSTAT<NOT_FIFOEMPTY>
extern volatile __bit                   NOT_FIFOEMPTY       __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 NOT_FIFOEMPTY_bit   _BIT_ACCESS(COMSTAT,7)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// RCSTA1<NOT_RC8>
extern volatile __bit                   NOT_RC8             __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 NOT_RC8_bit         _BIT_ACCESS(RCSTA1,6)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// TXSTA1<NOT_TX8>
extern volatile __bit                   NOT_TX8             __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 NOT_TX8_bit         _BIT_ACCESS(TXSTA1,6)
// SSPSTAT<NOT_W>
extern volatile __bit                   NOT_W               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W_bit           _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSPSTAT,2)
// PSPCON<OBF>
extern volatile __bit                   OBF                 __at(0x7A36);	// @ (0xF46 * 8 + 6)
#define                                 OBF_bit             _BIT_ACCESS(PSPCON,6)
// RCSTA1<OERR1>
extern volatile __bit                   OERR1               __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 OERR1_bit           _BIT_ACCESS(RCSTA1,1)
// RCSTA2<OERR2>
extern volatile __bit                   OERR2               __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 OERR2_bit           _BIT_ACCESS(RCSTA2,1)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DF4);	// @ (0xFBE * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DF5);	// @ (0xFBE * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DF6);	// @ (0xFBE * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DDE);	// @ (0xFBB * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DDF);	// @ (0xFBB * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DF7);	// @ (0xFBE * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<PC2>
extern volatile __bit                   PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// PORTE<PC3E>
extern volatile __bit                   PC3E                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PC3E_bit            _BIT_ACCESS(PORTE,3)
// ANCON0<PCFG0>
extern volatile __bit                   PCFG0               __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 PCFG0_bit           _BIT_ACCESS(ANCON0,0)
// ANCON0<PCFG1>
extern volatile __bit                   PCFG1               __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 PCFG1_bit           _BIT_ACCESS(ANCON0,1)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG13>
extern volatile __bit                   PCFG13              __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON0<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ANCON0,2)
// ANCON0<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ANCON0,3)
// ANCON0<PCFG4>
extern volatile __bit                   PCFG4               __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 PCFG4_bit           _BIT_ACCESS(ANCON0,4)
// ANCON0<PCFG5>
extern volatile __bit                   PCFG5               __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 PCFG5_bit           _BIT_ACCESS(ANCON0,5)
// ANCON0<PCFG6>
extern volatile __bit                   PCFG6               __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 PCFG6_bit           _BIT_ACCESS(ANCON0,6)
// ANCON0<PCFG7>
extern volatile __bit                   PCFG7               __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 PCFG7_bit           _BIT_ACCESS(ANCON0,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSPCON2<PEN>
extern volatile __bit                   PEN                 __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSPCON2,2)
// OSCTUNE<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7CDE);	// @ (0xF9B * 8 + 6)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCTUNE,6)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// BRGCON2<PRSEG0>
extern volatile __bit                   PRSEG0              __at(0x7220);	// @ (0xE44 * 8 + 0)
#define                                 PRSEG0_bit          _BIT_ACCESS(BRGCON2,0)
// BRGCON2<PRSEG1>
extern volatile __bit                   PRSEG1              __at(0x7221);	// @ (0xE44 * 8 + 1)
#define                                 PRSEG1_bit          _BIT_ACCESS(BRGCON2,1)
// BRGCON2<PRSEG2>
extern volatile __bit                   PRSEG2              __at(0x7222);	// @ (0xE44 * 8 + 2)
#define                                 PRSEG2_bit          _BIT_ACCESS(BRGCON2,2)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PMD1<PSPMD>
extern volatile __bit                   PSPMD               __at(0x7AC7);	// @ (0xF58 * 8 + 7)
#define                                 PSPMD_bit           _BIT_ACCESS(PMD1,7)
// PSPCON<PSPMODE>
extern volatile __bit                   PSPMODE             __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 PSPMODE_bit         _BIT_ACCESS(PSPCON,4)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DFA);	// @ (0xFBF * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DFB);	// @ (0xFBF * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF8);	// @ (0xFBF * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF9);	// @ (0xFBF * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// RXB0CON<RB0DBEN>
extern volatile __bit                   RB0DBEN             __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 RB0DBEN_bit         _BIT_ACCESS(RXB0CON,2)
// RXB0CON<RB0DBEN_FILHIT2>
extern volatile __bit                   RB0DBEN_FILHIT2     __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 RB0DBEN_FILHIT2_bit _BIT_ACCESS(RXB0CON,2)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
