MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K80/mcu.h
extern volatile __bit                   RXF10EID6           __at(0x72DE);	// @ (0xE5B * 8 + 6)
#define                                 RXF10EID6_bit       _BIT_ACCESS(RXF10EIDL,6)
// RXF10EIDL<RXF10EID7>
extern volatile __bit                   RXF10EID7           __at(0x72DF);	// @ (0xE5B * 8 + 7)
#define                                 RXF10EID7_bit       _BIT_ACCESS(RXF10EIDL,7)
// RXF10EIDH<RXF10EID8>
extern volatile __bit                   RXF10EID8           __at(0x72D0);	// @ (0xE5A * 8 + 0)
#define                                 RXF10EID8_bit       _BIT_ACCESS(RXF10EIDH,0)
// RXF10EIDH<RXF10EID9>
extern volatile __bit                   RXF10EID9           __at(0x72D1);	// @ (0xE5A * 8 + 1)
#define                                 RXF10EID9_bit       _BIT_ACCESS(RXF10EIDH,1)
// RXFCON1<RXF10EN>
extern volatile __bit                   RXF10EN             __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 RXF10EN_bit         _BIT_ACCESS(RXFCON1,2)
// RXF10SIDL<RXF10EXIDEN>
extern volatile __bit                   RXF10EXIDEN         __at(0x72CB);	// @ (0xE59 * 8 + 3)
#define                                 RXF10EXIDEN_bit     _BIT_ACCESS(RXF10SIDL,3)
// RXF10SIDL<RXF10SID0>
extern volatile __bit                   RXF10SID0           __at(0x72CD);	// @ (0xE59 * 8 + 5)
#define                                 RXF10SID0_bit       _BIT_ACCESS(RXF10SIDL,5)
// RXF10SIDL<RXF10SID1>
extern volatile __bit                   RXF10SID1           __at(0x72CE);	// @ (0xE59 * 8 + 6)
#define                                 RXF10SID1_bit       _BIT_ACCESS(RXF10SIDL,6)
// RXF10SIDH<RXF10SID10>
extern volatile __bit                   RXF10SID10          __at(0x72C7);	// @ (0xE58 * 8 + 7)
#define                                 RXF10SID10_bit      _BIT_ACCESS(RXF10SIDH,7)
// RXF10SIDL<RXF10SID2>
extern volatile __bit                   RXF10SID2           __at(0x72CF);	// @ (0xE59 * 8 + 7)
#define                                 RXF10SID2_bit       _BIT_ACCESS(RXF10SIDL,7)
// RXF10SIDH<RXF10SID3>
extern volatile __bit                   RXF10SID3           __at(0x72C0);	// @ (0xE58 * 8 + 0)
#define                                 RXF10SID3_bit       _BIT_ACCESS(RXF10SIDH,0)
// RXF10SIDH<RXF10SID4>
extern volatile __bit                   RXF10SID4           __at(0x72C1);	// @ (0xE58 * 8 + 1)
#define                                 RXF10SID4_bit       _BIT_ACCESS(RXF10SIDH,1)
// RXF10SIDH<RXF10SID5>
extern volatile __bit                   RXF10SID5           __at(0x72C2);	// @ (0xE58 * 8 + 2)
#define                                 RXF10SID5_bit       _BIT_ACCESS(RXF10SIDH,2)
// RXF10SIDH<RXF10SID6>
extern volatile __bit                   RXF10SID6           __at(0x72C3);	// @ (0xE58 * 8 + 3)
#define                                 RXF10SID6_bit       _BIT_ACCESS(RXF10SIDH,3)
// RXF10SIDH<RXF10SID7>
extern volatile __bit                   RXF10SID7           __at(0x72C4);	// @ (0xE58 * 8 + 4)
#define                                 RXF10SID7_bit       _BIT_ACCESS(RXF10SIDH,4)
// RXF10SIDH<RXF10SID8>
extern volatile __bit                   RXF10SID8           __at(0x72C5);	// @ (0xE58 * 8 + 5)
#define                                 RXF10SID8_bit       _BIT_ACCESS(RXF10SIDH,5)
// RXF10SIDH<RXF10SID9>
extern volatile __bit                   RXF10SID9           __at(0x72C6);	// @ (0xE58 * 8 + 6)
#define                                 RXF10SID9_bit       _BIT_ACCESS(RXF10SIDH,6)
// RXF11EIDL<RXF11EID0>
extern volatile __bit                   RXF11EID0           __at(0x72F8);	// @ (0xE5F * 8 + 0)
#define                                 RXF11EID0_bit       _BIT_ACCESS(RXF11EIDL,0)
// RXF11EIDL<RXF11EID1>
extern volatile __bit                   RXF11EID1           __at(0x72F9);	// @ (0xE5F * 8 + 1)
#define                                 RXF11EID1_bit       _BIT_ACCESS(RXF11EIDL,1)
// RXF11EIDH<RXF11EID10>
extern volatile __bit                   RXF11EID10          __at(0x72F2);	// @ (0xE5E * 8 + 2)
#define                                 RXF11EID10_bit      _BIT_ACCESS(RXF11EIDH,2)
// RXF11EIDH<RXF11EID11>
extern volatile __bit                   RXF11EID11          __at(0x72F3);	// @ (0xE5E * 8 + 3)
#define                                 RXF11EID11_bit      _BIT_ACCESS(RXF11EIDH,3)
// RXF11EIDH<RXF11EID12>
extern volatile __bit                   RXF11EID12          __at(0x72F4);	// @ (0xE5E * 8 + 4)
#define                                 RXF11EID12_bit      _BIT_ACCESS(RXF11EIDH,4)
// RXF11EIDH<RXF11EID13>
extern volatile __bit                   RXF11EID13          __at(0x72F5);	// @ (0xE5E * 8 + 5)
#define                                 RXF11EID13_bit      _BIT_ACCESS(RXF11EIDH,5)
// RXF11EIDH<RXF11EID14>
extern volatile __bit                   RXF11EID14          __at(0x72F6);	// @ (0xE5E * 8 + 6)
#define                                 RXF11EID14_bit      _BIT_ACCESS(RXF11EIDH,6)
// RXF11EIDH<RXF11EID15>
extern volatile __bit                   RXF11EID15          __at(0x72F7);	// @ (0xE5E * 8 + 7)
#define                                 RXF11EID15_bit      _BIT_ACCESS(RXF11EIDH,7)
// RXF11SIDL<RXF11EID16>
extern volatile __bit                   RXF11EID16          __at(0x72E8);	// @ (0xE5D * 8 + 0)
#define                                 RXF11EID16_bit      _BIT_ACCESS(RXF11SIDL,0)
// RXF11SIDL<RXF11EID17>
extern volatile __bit                   RXF11EID17          __at(0x72E9);	// @ (0xE5D * 8 + 1)
#define                                 RXF11EID17_bit      _BIT_ACCESS(RXF11SIDL,1)
// RXF11EIDL<RXF11EID2>
extern volatile __bit                   RXF11EID2           __at(0x72FA);	// @ (0xE5F * 8 + 2)
#define                                 RXF11EID2_bit       _BIT_ACCESS(RXF11EIDL,2)
// RXF11EIDL<RXF11EID3>
extern volatile __bit                   RXF11EID3           __at(0x72FB);	// @ (0xE5F * 8 + 3)
#define                                 RXF11EID3_bit       _BIT_ACCESS(RXF11EIDL,3)
// RXF11EIDL<RXF11EID4>
extern volatile __bit                   RXF11EID4           __at(0x72FC);	// @ (0xE5F * 8 + 4)
#define                                 RXF11EID4_bit       _BIT_ACCESS(RXF11EIDL,4)
// RXF11EIDL<RXF11EID5>
extern volatile __bit                   RXF11EID5           __at(0x72FD);	// @ (0xE5F * 8 + 5)
#define                                 RXF11EID5_bit       _BIT_ACCESS(RXF11EIDL,5)
// RXF11EIDL<RXF11EID6>
extern volatile __bit                   RXF11EID6           __at(0x72FE);	// @ (0xE5F * 8 + 6)
#define                                 RXF11EID6_bit       _BIT_ACCESS(RXF11EIDL,6)
// RXF11EIDL<RXF11EID7>
extern volatile __bit                   RXF11EID7           __at(0x72FF);	// @ (0xE5F * 8 + 7)
#define                                 RXF11EID7_bit       _BIT_ACCESS(RXF11EIDL,7)
// RXF11EIDH<RXF11EID8>
extern volatile __bit                   RXF11EID8           __at(0x72F0);	// @ (0xE5E * 8 + 0)
#define                                 RXF11EID8_bit       _BIT_ACCESS(RXF11EIDH,0)
// RXF11EIDH<RXF11EID9>
extern volatile __bit                   RXF11EID9           __at(0x72F1);	// @ (0xE5E * 8 + 1)
#define                                 RXF11EID9_bit       _BIT_ACCESS(RXF11EIDH,1)
// RXFCON1<RXF11EN>
extern volatile __bit                   RXF11EN             __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 RXF11EN_bit         _BIT_ACCESS(RXFCON1,3)
// RXF11SIDL<RXF11EXIDEN>
extern volatile __bit                   RXF11EXIDEN         __at(0x72EB);	// @ (0xE5D * 8 + 3)
#define                                 RXF11EXIDEN_bit     _BIT_ACCESS(RXF11SIDL,3)
// RXF11SIDL<RXF11SID0>
extern volatile __bit                   RXF11SID0           __at(0x72ED);	// @ (0xE5D * 8 + 5)
#define                                 RXF11SID0_bit       _BIT_ACCESS(RXF11SIDL,5)
// RXF11SIDL<RXF11SID1>
extern volatile __bit                   RXF11SID1           __at(0x72EE);	// @ (0xE5D * 8 + 6)
#define                                 RXF11SID1_bit       _BIT_ACCESS(RXF11SIDL,6)
// RXF11SIDH<RXF11SID10>
extern volatile __bit                   RXF11SID10          __at(0x72E7);	// @ (0xE5C * 8 + 7)
#define                                 RXF11SID10_bit      _BIT_ACCESS(RXF11SIDH,7)
// RXF11SIDL<RXF11SID2>
extern volatile __bit                   RXF11SID2           __at(0x72EF);	// @ (0xE5D * 8 + 7)
#define                                 RXF11SID2_bit       _BIT_ACCESS(RXF11SIDL,7)
// RXF11SIDH<RXF11SID3>
extern volatile __bit                   RXF11SID3           __at(0x72E0);	// @ (0xE5C * 8 + 0)
#define                                 RXF11SID3_bit       _BIT_ACCESS(RXF11SIDH,0)
// RXF11SIDH<RXF11SID4>
extern volatile __bit                   RXF11SID4           __at(0x72E1);	// @ (0xE5C * 8 + 1)
#define                                 RXF11SID4_bit       _BIT_ACCESS(RXF11SIDH,1)
// RXF11SIDH<RXF11SID5>
extern volatile __bit                   RXF11SID5           __at(0x72E2);	// @ (0xE5C * 8 + 2)
#define                                 RXF11SID5_bit       _BIT_ACCESS(RXF11SIDH,2)
// RXF11SIDH<RXF11SID6>
extern volatile __bit                   RXF11SID6           __at(0x72E3);	// @ (0xE5C * 8 + 3)
#define                                 RXF11SID6_bit       _BIT_ACCESS(RXF11SIDH,3)
// RXF11SIDH<RXF11SID7>
extern volatile __bit                   RXF11SID7           __at(0x72E4);	// @ (0xE5C * 8 + 4)
#define                                 RXF11SID7_bit       _BIT_ACCESS(RXF11SIDH,4)
// RXF11SIDH<RXF11SID8>
extern volatile __bit                   RXF11SID8           __at(0x72E5);	// @ (0xE5C * 8 + 5)
#define                                 RXF11SID8_bit       _BIT_ACCESS(RXF11SIDH,5)
// RXF11SIDH<RXF11SID9>
extern volatile __bit                   RXF11SID9           __at(0x72E6);	// @ (0xE5C * 8 + 6)
#define                                 RXF11SID9_bit       _BIT_ACCESS(RXF11SIDH,6)
// RXF12EIDL<RXF12EID0>
extern volatile __bit                   RXF12EID0           __at(0x7318);	// @ (0xE63 * 8 + 0)
#define                                 RXF12EID0_bit       _BIT_ACCESS(RXF12EIDL,0)
// RXF12EIDL<RXF12EID1>
extern volatile __bit                   RXF12EID1           __at(0x7319);	// @ (0xE63 * 8 + 1)
#define                                 RXF12EID1_bit       _BIT_ACCESS(RXF12EIDL,1)
// RXF12EIDH<RXF12EID10>
extern volatile __bit                   RXF12EID10          __at(0x7312);	// @ (0xE62 * 8 + 2)
#define                                 RXF12EID10_bit      _BIT_ACCESS(RXF12EIDH,2)
// RXF12EIDH<RXF12EID11>
extern volatile __bit                   RXF12EID11          __at(0x7313);	// @ (0xE62 * 8 + 3)
#define                                 RXF12EID11_bit      _BIT_ACCESS(RXF12EIDH,3)
// RXF12EIDH<RXF12EID12>
extern volatile __bit                   RXF12EID12          __at(0x7314);	// @ (0xE62 * 8 + 4)
#define                                 RXF12EID12_bit      _BIT_ACCESS(RXF12EIDH,4)
// RXF12EIDH<RXF12EID13>
extern volatile __bit                   RXF12EID13          __at(0x7315);	// @ (0xE62 * 8 + 5)
#define                                 RXF12EID13_bit      _BIT_ACCESS(RXF12EIDH,5)
// RXF12EIDH<RXF12EID14>
extern volatile __bit                   RXF12EID14          __at(0x7316);	// @ (0xE62 * 8 + 6)
#define                                 RXF12EID14_bit      _BIT_ACCESS(RXF12EIDH,6)
// RXF12EIDH<RXF12EID15>
extern volatile __bit                   RXF12EID15          __at(0x7317);	// @ (0xE62 * 8 + 7)
#define                                 RXF12EID15_bit      _BIT_ACCESS(RXF12EIDH,7)
// RXF12SIDL<RXF12EID16>
extern volatile __bit                   RXF12EID16          __at(0x7308);	// @ (0xE61 * 8 + 0)
#define                                 RXF12EID16_bit      _BIT_ACCESS(RXF12SIDL,0)
// RXF12SIDL<RXF12EID17>
extern volatile __bit                   RXF12EID17          __at(0x7309);	// @ (0xE61 * 8 + 1)
#define                                 RXF12EID17_bit      _BIT_ACCESS(RXF12SIDL,1)
// RXF12EIDL<RXF12EID2>
extern volatile __bit                   RXF12EID2           __at(0x731A);	// @ (0xE63 * 8 + 2)
#define                                 RXF12EID2_bit       _BIT_ACCESS(RXF12EIDL,2)
// RXF12EIDL<RXF12EID3>
extern volatile __bit                   RXF12EID3           __at(0x731B);	// @ (0xE63 * 8 + 3)
#define                                 RXF12EID3_bit       _BIT_ACCESS(RXF12EIDL,3)
// RXF12EIDL<RXF12EID4>
extern volatile __bit                   RXF12EID4           __at(0x731C);	// @ (0xE63 * 8 + 4)
#define                                 RXF12EID4_bit       _BIT_ACCESS(RXF12EIDL,4)
// RXF12EIDL<RXF12EID5>
extern volatile __bit                   RXF12EID5           __at(0x731D);	// @ (0xE63 * 8 + 5)
#define                                 RXF12EID5_bit       _BIT_ACCESS(RXF12EIDL,5)
// RXF12EIDL<RXF12EID6>
extern volatile __bit                   RXF12EID6           __at(0x731E);	// @ (0xE63 * 8 + 6)
#define                                 RXF12EID6_bit       _BIT_ACCESS(RXF12EIDL,6)
// RXF12EIDL<RXF12EID7>
extern volatile __bit                   RXF12EID7           __at(0x731F);	// @ (0xE63 * 8 + 7)
#define                                 RXF12EID7_bit       _BIT_ACCESS(RXF12EIDL,7)
// RXF12EIDH<RXF12EID8>
extern volatile __bit                   RXF12EID8           __at(0x7310);	// @ (0xE62 * 8 + 0)
#define                                 RXF12EID8_bit       _BIT_ACCESS(RXF12EIDH,0)
// RXF12EIDH<RXF12EID9>
extern volatile __bit                   RXF12EID9           __at(0x7311);	// @ (0xE62 * 8 + 1)
#define                                 RXF12EID9_bit       _BIT_ACCESS(RXF12EIDH,1)
// RXFCON1<RXF12EN>
extern volatile __bit                   RXF12EN             __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 RXF12EN_bit         _BIT_ACCESS(RXFCON1,4)
// RXF12SIDL<RXF12EXIDEN>
extern volatile __bit                   RXF12EXIDEN         __at(0x730B);	// @ (0xE61 * 8 + 3)
#define                                 RXF12EXIDEN_bit     _BIT_ACCESS(RXF12SIDL,3)
// RXF12SIDL<RXF12SID0>
extern volatile __bit                   RXF12SID0           __at(0x730D);	// @ (0xE61 * 8 + 5)
#define                                 RXF12SID0_bit       _BIT_ACCESS(RXF12SIDL,5)
// RXF12SIDL<RXF12SID1>
extern volatile __bit                   RXF12SID1           __at(0x730E);	// @ (0xE61 * 8 + 6)
#define                                 RXF12SID1_bit       _BIT_ACCESS(RXF12SIDL,6)
// RXF12SIDH<RXF12SID10>
extern volatile __bit                   RXF12SID10          __at(0x7307);	// @ (0xE60 * 8 + 7)
#define                                 RXF12SID10_bit      _BIT_ACCESS(RXF12SIDH,7)
// RXF12SIDL<RXF12SID2>
extern volatile __bit                   RXF12SID2           __at(0x730F);	// @ (0xE61 * 8 + 7)
#define                                 RXF12SID2_bit       _BIT_ACCESS(RXF12SIDL,7)
// RXF12SIDH<RXF12SID3>
extern volatile __bit                   RXF12SID3           __at(0x7300);	// @ (0xE60 * 8 + 0)
#define                                 RXF12SID3_bit       _BIT_ACCESS(RXF12SIDH,0)
// RXF12SIDH<RXF12SID4>
extern volatile __bit                   RXF12SID4           __at(0x7301);	// @ (0xE60 * 8 + 1)
#define                                 RXF12SID4_bit       _BIT_ACCESS(RXF12SIDH,1)
// RXF12SIDH<RXF12SID5>
extern volatile __bit                   RXF12SID5           __at(0x7302);	// @ (0xE60 * 8 + 2)
#define                                 RXF12SID5_bit       _BIT_ACCESS(RXF12SIDH,2)
// RXF12SIDH<RXF12SID6>
extern volatile __bit                   RXF12SID6           __at(0x7303);	// @ (0xE60 * 8 + 3)
#define                                 RXF12SID6_bit       _BIT_ACCESS(RXF12SIDH,3)
// RXF12SIDH<RXF12SID7>
extern volatile __bit                   RXF12SID7           __at(0x7304);	// @ (0xE60 * 8 + 4)
#define                                 RXF12SID7_bit       _BIT_ACCESS(RXF12SIDH,4)
// RXF12SIDH<RXF12SID8>
extern volatile __bit                   RXF12SID8           __at(0x7305);	// @ (0xE60 * 8 + 5)
#define                                 RXF12SID8_bit       _BIT_ACCESS(RXF12SIDH,5)
// RXF12SIDH<RXF12SID9>
extern volatile __bit                   RXF12SID9           __at(0x7306);	// @ (0xE60 * 8 + 6)
#define                                 RXF12SID9_bit       _BIT_ACCESS(RXF12SIDH,6)
// RXF13EIDL<RXF13EID0>
extern volatile __bit                   RXF13EID0           __at(0x7338);	// @ (0xE67 * 8 + 0)
#define                                 RXF13EID0_bit       _BIT_ACCESS(RXF13EIDL,0)
// RXF13EIDL<RXF13EID1>
extern volatile __bit                   RXF13EID1           __at(0x7339);	// @ (0xE67 * 8 + 1)
#define                                 RXF13EID1_bit       _BIT_ACCESS(RXF13EIDL,1)
// RXF13EIDH<RXF13EID10>
extern volatile __bit                   RXF13EID10          __at(0x7332);	// @ (0xE66 * 8 + 2)
#define                                 RXF13EID10_bit      _BIT_ACCESS(RXF13EIDH,2)
// RXF13EIDH<RXF13EID11>
extern volatile __bit                   RXF13EID11          __at(0x7333);	// @ (0xE66 * 8 + 3)
#define                                 RXF13EID11_bit      _BIT_ACCESS(RXF13EIDH,3)
// RXF13EIDH<RXF13EID12>
extern volatile __bit                   RXF13EID12          __at(0x7334);	// @ (0xE66 * 8 + 4)
#define                                 RXF13EID12_bit      _BIT_ACCESS(RXF13EIDH,4)
// RXF13EIDH<RXF13EID13>
extern volatile __bit                   RXF13EID13          __at(0x7335);	// @ (0xE66 * 8 + 5)
#define                                 RXF13EID13_bit      _BIT_ACCESS(RXF13EIDH,5)
// RXF13EIDH<RXF13EID14>
extern volatile __bit                   RXF13EID14          __at(0x7336);	// @ (0xE66 * 8 + 6)
#define                                 RXF13EID14_bit      _BIT_ACCESS(RXF13EIDH,6)
// RXF13EIDH<RXF13EID15>
extern volatile __bit                   RXF13EID15          __at(0x7337);	// @ (0xE66 * 8 + 7)
#define                                 RXF13EID15_bit      _BIT_ACCESS(RXF13EIDH,7)
// RXF13SIDL<RXF13EID16>
extern volatile __bit                   RXF13EID16          __at(0x7328);	// @ (0xE65 * 8 + 0)
#define                                 RXF13EID16_bit      _BIT_ACCESS(RXF13SIDL,0)
// RXF13SIDL<RXF13EID17>
extern volatile __bit                   RXF13EID17          __at(0x7329);	// @ (0xE65 * 8 + 1)
#define                                 RXF13EID17_bit      _BIT_ACCESS(RXF13SIDL,1)
// RXF13EIDL<RXF13EID2>
extern volatile __bit                   RXF13EID2           __at(0x733A);	// @ (0xE67 * 8 + 2)
#define                                 RXF13EID2_bit       _BIT_ACCESS(RXF13EIDL,2)
// RXF13EIDL<RXF13EID3>
extern volatile __bit                   RXF13EID3           __at(0x733B);	// @ (0xE67 * 8 + 3)
#define                                 RXF13EID3_bit       _BIT_ACCESS(RXF13EIDL,3)
// RXF13EIDL<RXF13EID4>
extern volatile __bit                   RXF13EID4           __at(0x733C);	// @ (0xE67 * 8 + 4)
#define                                 RXF13EID4_bit       _BIT_ACCESS(RXF13EIDL,4)
// RXF13EIDL<RXF13EID5>
extern volatile __bit                   RXF13EID5           __at(0x733D);	// @ (0xE67 * 8 + 5)
#define                                 RXF13EID5_bit       _BIT_ACCESS(RXF13EIDL,5)
// RXF13EIDL<RXF13EID6>
extern volatile __bit                   RXF13EID6           __at(0x733E);	// @ (0xE67 * 8 + 6)
#define                                 RXF13EID6_bit       _BIT_ACCESS(RXF13EIDL,6)
// RXF13EIDL<RXF13EID7>
extern volatile __bit                   RXF13EID7           __at(0x733F);	// @ (0xE67 * 8 + 7)
#define                                 RXF13EID7_bit       _BIT_ACCESS(RXF13EIDL,7)
// RXF13EIDH<RXF13EID8>
extern volatile __bit                   RXF13EID8           __at(0x7330);	// @ (0xE66 * 8 + 0)
#define                                 RXF13EID8_bit       _BIT_ACCESS(RXF13EIDH,0)
// RXF13EIDH<RXF13EID9>
extern volatile __bit                   RXF13EID9           __at(0x7331);	// @ (0xE66 * 8 + 1)
#define                                 RXF13EID9_bit       _BIT_ACCESS(RXF13EIDH,1)
// RXFCON1<RXF13EN>
extern volatile __bit                   RXF13EN             __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 RXF13EN_bit         _BIT_ACCESS(RXFCON1,5)
// RXF13SIDL<RXF13EXIDEN>
extern volatile __bit                   RXF13EXIDEN         __at(0x732B);	// @ (0xE65 * 8 + 3)
#define                                 RXF13EXIDEN_bit     _BIT_ACCESS(RXF13SIDL,3)
// RXF13SIDL<RXF13SID0>
extern volatile __bit                   RXF13SID0           __at(0x732D);	// @ (0xE65 * 8 + 5)
#define                                 RXF13SID0_bit       _BIT_ACCESS(RXF13SIDL,5)
// RXF13SIDL<RXF13SID1>
extern volatile __bit                   RXF13SID1           __at(0x732E);	// @ (0xE65 * 8 + 6)
#define                                 RXF13SID1_bit       _BIT_ACCESS(RXF13SIDL,6)
// RXF13SIDH<RXF13SID10>
extern volatile __bit                   RXF13SID10          __at(0x7327);	// @ (0xE64 * 8 + 7)
#define                                 RXF13SID10_bit      _BIT_ACCESS(RXF13SIDH,7)
// RXF13SIDL<RXF13SID2>
extern volatile __bit                   RXF13SID2           __at(0x732F);	// @ (0xE65 * 8 + 7)
#define                                 RXF13SID2_bit       _BIT_ACCESS(RXF13SIDL,7)
// RXF13SIDH<RXF13SID3>
extern volatile __bit                   RXF13SID3           __at(0x7320);	// @ (0xE64 * 8 + 0)
#define                                 RXF13SID3_bit       _BIT_ACCESS(RXF13SIDH,0)
// RXF13SIDH<RXF13SID4>
extern volatile __bit                   RXF13SID4           __at(0x7321);	// @ (0xE64 * 8 + 1)
#define                                 RXF13SID4_bit       _BIT_ACCESS(RXF13SIDH,1)
// RXF13SIDH<RXF13SID5>
extern volatile __bit                   RXF13SID5           __at(0x7322);	// @ (0xE64 * 8 + 2)
#define                                 RXF13SID5_bit       _BIT_ACCESS(RXF13SIDH,2)
// RXF13SIDH<RXF13SID6>
extern volatile __bit                   RXF13SID6           __at(0x7323);	// @ (0xE64 * 8 + 3)
#define                                 RXF13SID6_bit       _BIT_ACCESS(RXF13SIDH,3)
// RXF13SIDH<RXF13SID7>
extern volatile __bit                   RXF13SID7           __at(0x7324);	// @ (0xE64 * 8 + 4)
#define                                 RXF13SID7_bit       _BIT_ACCESS(RXF13SIDH,4)
// RXF13SIDH<RXF13SID8>
extern volatile __bit                   RXF13SID8           __at(0x7325);	// @ (0xE64 * 8 + 5)
#define                                 RXF13SID8_bit       _BIT_ACCESS(RXF13SIDH,5)
// RXF13SIDH<RXF13SID9>
extern volatile __bit                   RXF13SID9           __at(0x7326);	// @ (0xE64 * 8 + 6)
#define                                 RXF13SID9_bit       _BIT_ACCESS(RXF13SIDH,6)
// RXF14EIDL<RXF14EID0>
extern volatile __bit                   RXF14EID0           __at(0x7358);	// @ (0xE6B * 8 + 0)
#define                                 RXF14EID0_bit       _BIT_ACCESS(RXF14EIDL,0)
// RXF14EIDL<RXF14EID1>
extern volatile __bit                   RXF14EID1           __at(0x7359);	// @ (0xE6B * 8 + 1)
#define                                 RXF14EID1_bit       _BIT_ACCESS(RXF14EIDL,1)
// RXF14EIDH<RXF14EID10>
extern volatile __bit                   RXF14EID10          __at(0x7352);	// @ (0xE6A * 8 + 2)
#define                                 RXF14EID10_bit      _BIT_ACCESS(RXF14EIDH,2)
// RXF14EIDH<RXF14EID11>
extern volatile __bit                   RXF14EID11          __at(0x7353);	// @ (0xE6A * 8 + 3)
#define                                 RXF14EID11_bit      _BIT_ACCESS(RXF14EIDH,3)
// RXF14EIDH<RXF14EID12>
extern volatile __bit                   RXF14EID12          __at(0x7354);	// @ (0xE6A * 8 + 4)
#define                                 RXF14EID12_bit      _BIT_ACCESS(RXF14EIDH,4)
// RXF14EIDH<RXF14EID13>
extern volatile __bit                   RXF14EID13          __at(0x7355);	// @ (0xE6A * 8 + 5)
#define                                 RXF14EID13_bit      _BIT_ACCESS(RXF14EIDH,5)
// RXF14EIDH<RXF14EID14>
extern volatile __bit                   RXF14EID14          __at(0x7356);	// @ (0xE6A * 8 + 6)
#define                                 RXF14EID14_bit      _BIT_ACCESS(RXF14EIDH,6)
// RXF14EIDH<RXF14EID15>
extern volatile __bit                   RXF14EID15          __at(0x7357);	// @ (0xE6A * 8 + 7)
